[
    {
        "doc_id": "merged_doc9",
        "text": "A market economy is an economic system where decisions regarding investment, production, and distribution are based on the interplay of supply and demand,[1] which determines the prices of goods and services.[2] The major defining characteristic of a market economy is that investment decisions, or the allocation of producer good, are primarily made through capital and financial markets.[3] This is contrasted with a planned economy, where investment and production decisions are embodied in an integrated plan of production established by a state or other organizational body that controls the factors of production.\nMarket economies can range from free market systems to regulated markets and various forms of interventionist variants. In reality, free markets do not exist in pure form, since societies and governments all regulate them to varying degrees.[4][5] Different perspectives exist as to how strong a role the government should have in both guiding and regulating market economies and addressing the inequalities the market naturally produces. Most existing market economies include a degree of state-directed activity or economic planning, and are thus classified as mixed economies. The term free-market economy is sometimes used synonymously with market economy.[6]\nMarket economies do not logically presuppose the existence of private ownership of the means of production. A market economy can and often does include various types of cooperatives, collectives, or autonomous state agencies that acquire and exchange capital goods in capital markets. These all utilize a market-determined free price system to allocate capital goods and labor.[3] In addition, there are many variations of market socialism, some of which involve employee-owned enterprises based on self-management; as well as models that involve the combination of public ownership of the means of production with factor markets.[7]\nCapitalism generally refers to an economic system where the means of production are largely or entirely privately owned and operated for a profit, structured on the process of capital accumulation. In general, in capitalist systems investment, distribution, income, and prices are determined by markets, whether regulated or unregulated.\nThere are different variations of capitalism with different relationships to markets. In Laissez-faire and free market variations of capitalism, markets are utilized most extensively with minimal or no state intervention and regulation over prices and the supply of goods and services. In interventionist, welfare capitalism and mixed economies, markets continue to play a dominant role but are regulated to some extent by government in order to correct market failures or to promote social welfare. In state capitalist systems, markets are relied upon the least, with the state relying heavily on either indirect economic planning and/or state-owned enterprises to accumulate capital.\nCapitalism has been dominant in the Western world since the end of feudalism, but most feel[who?] that the term \"mixed economies\" more precisely describes most contemporary economies, due to their containing both private-owned and state-owned enterprises. In capitalism, prices determine the demand-supply scale. For example, higher demand for certain goods and services lead to higher prices and lower demand for certain goods lead to lower prices.\nLaissez-faire is synonymous with what was referred to as strict capitalist free market economy during the early and mid-19th century[citation needed] as a classical liberal (right-libertarian) ideal to achieve. It is generally understood that the necessary components for the functioning of an idealized free market include the complete absence of government regulation, subsidies, artificial price pressures, and government-granted monopolies (usually classified as coercive monopoly by free market advocates) and no taxes or tariffs other than what is necessary for the government to provide protection from coercion and theft, maintaining peace and property rights, and providing for basic public goods. Right-libertarian advocates of anarcho-capitalism see the state as morally illegitimate and economically unnecessary and destructive.\nFree-market economy refers to an economic system where prices for goods and services are set freely by the forces of supply and demand and are allowed to reach their point of equilibrium without intervention by government policy. It typically entails support for highly competitive markets, private ownership of productive enterprises. Laissez-faire is a more extensive form of free-market economy where the role of the state is limited to protecting property rights.\nWelfare capitalism refers to a capitalist economy that includes public policies favoring extensive provisions for social welfare services. The economic mechanism involves a free market and the predominance of privately owned enterprises in the economy, but public provision of universal welfare services aimed at enhancing individual autonomy and maximizing equality. Examples of contemporary welfare capitalism include the Nordic model of capitalism predominant in Northern Europe.[8]\nAnglo-Saxon capitalism refers to the form of capitalism predominant in Anglophone countries and typified by the economy of the United States. It is contrasted with European models of capitalism such as the continental Social market model and the Nordic model. Anglo-Saxon capitalism refers to a macroeconomic policy regime and capital market structure common to the Anglophone economies. Among these characteristics are low rates of taxation, more open financial markets, lower labor market protections, and a less generous welfare state eschewing collective bargaining schemes found in the continental and northern European models of capitalism.[9]\nThe East Asian model of capitalism involves a strong role for state investment, and in some instances involves state-owned enterprises. The state takes an active role in promoting economic development through subsidies, the facilitation of \"national champions\", and an export-based model of growth. The actual practice of this model varies by country. This designation has been applied to the economies of Singapore, Japan, Taiwan, South Korea and the People's Republic of China.\nA related concept in political science is the developmental state.\nThis model was implemented by Alfred Müller-Armack and Ludwig Erhard after World War II in West Germany. The social market economic model (sometimes called \"Rhine capitalism\") is based upon the idea of realizing the benefits of a free market economy, especially economic performance and high supply of goods, while avoiding disadvantages such as market failure, destructive competition, concentration of economic power and the socially harmful effects of market processes. The aim of the social market economy is to realize greatest prosperity combined with best possible social security. One difference from the free market economy is that the state is not passive, but takes active regulatory measures.[10] The social policy objectives include employment, housing and education policies, as well as a socio-politically motivated balancing of the distribution of income growth. Characteristics of social market economies are a strong competition policy and a contractionary monetary policy. The philosophical background is Neoliberalism or Ordoliberalism[11]\nMarket socialism refers to various types of economic systems where the means of production and the dominant economic institutions are either publicly owned or cooperatively owned but operated according to the rules of supply and demand. This type of market economy has its roots in classical economics and in the works of Adam Smith, the Ricardian socialists, and Mutualist philosophers.[12]\nThe distinguishing feature between non-market socialism and market socialism is the existence of a market for factors of production and the criteria of profitability for enterprises. Profits derived from publicly owned enterprises can variously be used to reinvest in further production, to directly finance government and social services, or be distributed to the public at large through a social dividend or basic income system.[13]\nIn the 1930s the economists Oskar Lange and Abba Lerner developed a model of socialism that posited that a public body (dubbed the \"Central Planning Board\") could set prices through a trial-and-error approach until they equaled the marginal cost of production in order to achieve perfect competition and pareto optimality. In this model of socialism, firms would be state-owned and managed by their employees, and the profits would be disbursed among the population in a social dividend. This model came to be referred to as \"market socialism\" because it involved the use of money, a price system, and simulated capital markets; all of which were absent from traditional of non-market socialism.\nA more contemporary model of market socialism is that put forth by the American economist John Roemer, referred to as Economic democracy. In this model, social ownership is achieved through public ownership of equity in a market economy. A Bureau of Public Ownership (BPO) would own controlling shares in publicly listed firms, so that the profits generated would be used for public finance and the provision of a basic income.\nLibertarian socialists and left-anarchists often promote a form of market socialism in which enterprises are owned and managed cooperatively by their workforce so that the profits directly remunerate the employee-owners. These cooperative enterprises would compete with each other in the same way private companies compete with each other in a capitalist market. The first major elaboration of this type of market socialism was made by Pierre Joseph Proudhon and was called \"mutualism\".\nSelf-managed market socialism was promoted in Yugoslavia by economists Branko Horvat and Jaroslav Vanek. In the self-managed model of socialism, firms would be directly owned by their employees and the management board would be elected by employees. These cooperative firms would compete with each other in a market for both capital goods and for selling consumer goods.\nFollowing the 1978 reforms, the People's Republic of China developed what it calls a \"socialist market economy\", in which most of the economy is under state ownership, with the state enterprises organized as joint-stock companies with various government agencies owning controlling shares through a shareholder system. Prices are set by a largely free-price system and the state-owned enterprises are not subjected to micromanagement by a government planning agency. A similar system called \"socialist-oriented market economy\" has emerged in Vietnam following the Đổi Mới reforms in 1986. This system is frequently characterized as \"state capitalism\" instead of market socialism because there is no meaningful degree of employee self-management in firms, because the state enterprises retain their profits instead of distributing them to the workforce or government, and because many function as de facto private enterprises. The profits neither finance a social dividend to benefit the population at large, nor do they accrue to their employees.\nIn the People's Republic of China, this economic model is presented as a \"preliminary stage of socialism\" to explain the dominance of capitalistic management practices and forms of enterprise organization in both the state and non-state sectors.\nThe economist Joseph Stiglitz argues that markets suffer from informational inefficiency and the presumed efficiency of markets stems from the faulty assumptions of neoclassical welfare economics, particularly the assumption of perfect and costless information, and related incentive problems. Neoclassical economics assumes static equilibrium, and efficient markets require that there be no non-convexities, even though nonconvexities are pervasive in modern economies. Stiglitz's critique applies to both existing models of capitalism and to hypothetical models of market socialism. However, Stiglitz does not advocate replacing markets, but states that there is a significant role for government intervention to boost the efficiency of markets and to address the pervasive market failures that exist in contemporary economies.[14] A fair Market Economy is in fact a Martingale or a Brownian motion model and for a participant competitor in such a model there is no more than 50% of success chances at any given moment. Due to the fractal nature of any fair market and being market participants subject to the law of competition, which impose reinvesting an increasing part of profits, the mean statistical chance of bankruptcy within the half life of any participant is also 50% [15] and 100% whether an infinite sample of time is considered.\nRobin Hahnel and Michael Albert claim that \"markets inherently produce class division.\"[16] Albert states that even if everyone started out with a balanced job complex (doing a mix of roles of varying creativity, responsibility and empowerment) in a market economy, class divisions would arise.\nWithout taking the argument that far, it is evident that in a market system with uneven distribution of empowering work, such as Economic Democracy, some workers will be more able than others to capture the benefits of economic gain. For example, if one worker designs cars and another builds them, the designer will use his cognitive skills more frequently than the builder. In the long term, the designer will become more adept at conceptual work than the builder, giving the former greater bargaining power in a firm over the distribution of income. A conceptual worker who is not satisfied with his income can threaten to work for a company that will pay him more. The effect is a class division between conceptual and manual laborers, and ultimately managers and workers, and a de facto labor market for conceptual workers.[16]\nDavid McNally argues that the logic of the market inherently produces inequitable outcomes and leads to unequal exchanges, arguing that Adam Smith's moral intent and moral philosophy espousing equal exchange was undermined by the practice of the free markets he championed. The development of the market economy involved coercion, exploitation and violence that Adam Smith's moral philosophy could not countenance. McNally also criticizes market socialists for believing in the possibility of \"fair\" markets based on equal exchanges to be achieved by purging \"parasitical\" elements from the market economy, such as private ownership of the means of production. McNally argues that market socialism is an oxymoron when socialism is defined as an end to wage-based labor.[17]",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"market_economy\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"market economy\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"planned_economy\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"planned economy\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"capitalism\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"capitalism\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"laissez_faire\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"laissez-faire\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"welfare_capitalism\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"welfare capitalism\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"anglo_saxon_capitalism\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"anglo-saxon capitalism\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"east_asian_capitalism\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"east asian capitalism\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"social_market_economy\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"social market economy\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"market_socialism\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"market socialism\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"oskar_lange\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"oskar lange\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"abba_lerner\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"abba lerner\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"john_roemer\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"john roemer\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"branko_horvat\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"branko horvat\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"jaroslav_vanek\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"jaroslav vanek\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"joseph_stiglitz\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"joseph stiglitz\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"robin_hahnel\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"robin hahnel\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"michael_albert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"michael albert\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"david_mcnally\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"david mcnally\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"market_economy\",\n      \"target\": \"planned_economy\",\n      \"type\": \"CONTRASTED_WITH\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"capitalism\",\n      \"target\": \"market_economy\",\n      \"type\": \"RELATED_TO\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"laissez_faire\",\n      \"target\": \"free_market_economy\",\n      \"type\": \"SYNONYMOUS_WITH\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"welfare_capitalism\",\n      \"target\": \"capitalism\",\n      \"type\": \"VARIATION_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"anglo_saxon_capitalism\",\n      \"target\": \"capitalism\",\n      \"type\": \"VARIATION_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"east_asian_capitalism\",\n      \"target\": \"capitalism\",\n      \"type\": \"VARIATION_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"social_market_economy\",\n      \"target\": \"market_economy\",\n      \"type\": \"RELATED_TO\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"market_socialism\",\n      \"target\": \"socialism\",\n      \"type\": \"RELATED_TO\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc11",
        "text": "\"Can't Help Falling in Love\" is a pop ballad originally recorded by American singer Elvis Presley and published by Gladys Music, Presley's publishing company. It was written by Hugo Peretti, Luigi Creatore, and George David Weiss.[2] The melody is based on \"Plaisir d'amour\",[4] a popular romance by Jean-Paul-Égide Martini (1784). The song was featured in Presley's 1961 film, Blue Hawaii. During the following four decades, it was recorded by numerous other artists, including Tom Smothers, Swedish pop group A-Teens, and the British reggae group UB40, whose 1993 version topped the U.S. and UK charts.\nElvis Presley's version of the song topped the British charts in 1962. The single is certified Platinum by the RIAA, for US sales in excess of one million copies. In the United States, the song peaked at No. 2 on the US Billboard Hot 100 behind Joey Dee and the Starliters' \"Peppermint Twist\"[5] and went to No. 1 on the Adult Contemporary chart for six weeks.[6][7]\nDuring Presley's late 1960s and 1970s live performances, the song was performed as the show's finale. Most notably, it was also sung in the live segment of his 1968 NBC television special, and as the closer for his 1973 Global telecast, Aloha from Hawaii. A version with a faster arrangement was the closing number in Presley's final TV special, Elvis in Concert. \"Can't Help Falling in Love\" was also the last song he performed live, at his concert in Indianapolis at Market Square Arena on 26 June 1977.[8]\nIn 2015, the song was included on the If I Can Dream album, on the occasion of the 80th anniversary of Presley's birth. The version uses archival voice recordings of Presley and his singers, backed by new orchestral arrangements performed by the Royal Philharmonic Orchestra.\n7\" single\nIn 1993, British reggae band UB40 recorded the song as the first single from their 1993 album Promises and Lies. The song was released in May 1993, in the majority of countries worldwide. It eventually climbed to No. 1 on the US Billboard Hot 100 after debuting at No. 100, and remained there for seven weeks. It was also No. 1 in the United Kingdom, Austria, Netherlands, Sweden, Australia, and New Zealand.\nThe song appears on the soundtrack of the movie Sliver,[9] the trailer for Fools Rush In, and an episode of Hindsight. In the US, and on the Sliver soundtrack, the song title was listed as \"Can't Help Falling in Love,\" rather than what appeared on the record sleeve. The single version of the song also has a slightly different backing rhythm and melody.\nThe song and band also appear in the 1997 film Speed 2: Cruise Control.\n10\" single\n7\" single\n*sales figures based on certification alone\n^shipments figures based on certification alone\nThe song was the A-Teens's first single from their first extended play Pop 'til You Drop!, as well as for the Lilo & Stitch movie soundtrack, which was originally scheduled to include several Presley tracks, the A-Teens picking it for inclusion in the soundtrack. It was later also featured as a bonus track on their third studio album, New Arrival for the European market. The video had thus tremendous exposure on several television channels, with the A-Teens eventually including the song in their third album. As a result, the song had two music videos, one to promote the Disney movie, the other for the album. It is also shown in the teen pop compilation album, Disney Girlz Rock.\nThe song reached No. 12 in Sweden, No. 16 in Argentina, and No. 41 in Australia.\nThe video was directed by Gregory Dark and filmed in Los Angeles, California. It had two different versions. The \"Disney Version\", as the fans named it, features scenes of the movie, and also new scenes of the A-Teens with beach costumes. The \"A-Teens Version\" of the video, features the A-Teens on the white background with different close-ups and choreography, and scenes with puppies and different costumes.\nTracks marked + are not A-Teens tracks.\nEuropean 2-track CD single\nEuropean/Australian CD maxi",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"cant_help_falling_in_love\",\n      \"label\": \"song\",\n      \"attributes\": {\n        \"name\": \"can't help falling in love\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"elvis_presley\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"elvis presley\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"blue_hawaii\",\n      \"label\": \"work\",\n      \"attributes\": {\n        \"name\": \"blue hawaii\",\n        \"releaseYear\": \"1961\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"ub40\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"ub40\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"a_teens\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"a-teens\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"gladys_music\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"gladys music\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"jean_paul_martini\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"jean-paul-égide martini\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"royal_philharmonic_orchestra\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"royal philharmonic orchestra\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"elvis_presley\",\n      \"target\": \"cant_help_falling_in_love\",\n      \"type\": \"RECORDED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"gladys_music\",\n      \"target\": \"cant_help_falling_in_love\",\n      \"type\": \"PUBLISHED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"ub40\",\n      \"target\": \"cant_help_falling_in_love\",\n      \"type\": \"RECORDED_BY\",\n      \"attributes\": {\n        \"year\": \"1993\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"a_teens\",\n      \"target\": \"cant_help_falling_in_love\",\n      \"type\": \"RECORDED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"elvis_presley\",\n      \"target\": \"blue_hawaii\",\n      \"type\": \"FEATURED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"cant_help_falling_in_love\",\n      \"target\": \"jean_paul_martini\",\n      \"type\": \"MELODY_BASED_ON\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"royal_philharmonic_orchestra\",\n      \"target\": \"cant_help_falling_in_love\",\n      \"type\": \"PERFORMED_WITH\",\n      \"attributes\": {\n        \"year\": \"2015\",\n        \"context\": \"If I Can Dream album\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc46",
        "text": "Lorraine Toussaint (born April 4, 1960) is a Trinidadian-American actress and producer.\nToussaint began her career in theatre before supporting performances in films such as Breaking In (1989), Hudson Hawk (1991), and Dangerous Minds (1995). As lead actress, she is best known for her role as Rene Jackson in the critically acclaimed Lifetime television drama series Any Day Now, from 1998 to 2002, and her recurring role as defense attorney Shambala Green in the NBC legal drama Law & Order. Toussaint later appeared as a regular cast member in the NBC police procedural Crossing Jordan (2002–03) and the TNT crime drama Saving Grace (2007–10). Toussaint has also made over 30 guest appearances on television, starred in a number of made-for-television movies, and had recurring roles in Ugly Betty, Friday Night Lights, Body of Proof, and The Fosters. She co-starred in the ABC fantasy-drama series Forever (2014–15), and recently co-starred in the Fox comedy-drama Rosewood.\nToussaint received critical acclaim and an Independent Spirit Award nomination for her performance in the 2012 drama film Middle of Nowhere, written and directed by Ava DuVernay. In 2014, she played the role of Yvonne \"Vee\" Parker, the main antagonist in the second season of the Netflix comedy-drama series Orange Is the New Black, for which she received critical acclaim and a Critics' Choice Television Award for Best Supporting Actress in a Drama Series. She later played the role of Amelia Boynton Robinson in the 2014 historical drama film Selma, directed by Ava DuVernay.\nToussaint was born in Trinidad and Tobago. In an interview she said: \"I grew up under the British system, which I think is horrific for children -- very, very strict -- a system that did not recognize children as being individuals. You were small animals earning the right to be human. Childhood for me then felt extraordinarily powerless, and as an artistic child who learned in alternative ways, it was hell. I was beaten regularly... A good child was a fearful child, and I was a very, very, good child, which meant I lived in a world of silent, dark terror most of the time.\"[1] Her mother was a teacher, and brought Toussaint to live in Brooklyn in the late 1960s.[2]\nToussaint graduated from Manhattan's High School of Performing Arts in 1978.[3] She then attended the Juilliard School's drama division as a member of Group 11 (1978â€“1982),[4] where her classmates in 1982 included Megan Gallagher, Penny Johnson Jerald, Jack Kenny, and Jack Stehlin.[5] Toussaint graduated from Juilliard with a Bachelor of Fine Arts degree.[3] She then began her career as Shakespearean actress before tackling screen acting in television and film.[6]\nToussaint made her screen debut in 1983. In 1986 she played the role of widow of a man shot and killed by Boston cops in the television film A Case of Deadly Force based on the book by Lawrence O'Donnell.[7] She later had a recurring role of Vera Williams in the ABC daytime soap opera, One Life to Live, and alongside stage career appeared in guest starring roles in series like 227 and Law & Order (as recurring defense lawyer Shambala Green), and acted in a number of television films in the 1990s.\nToussaint has made her film debut in the female lead role opposite Burt Reynolds in the crime comedy Breaking In (1989). The film received positive reviews from critics,[8] but flopped in box office.[9] In 1991 she appeared opposite Bruce Willis in Hudson Hawk, and later co-starred alongside Michelle Pfeiffer in Dangerous Minds (1995). She also appeared in films Point of No Return (1993), Mother's Boys (1994), and Black Dog (1998). On television, Toussaint had regular roles in short-lived series Bodies of Evidence (CBS, 1992), Where I Live (ABC, 1993), Amazing Grace (NBC, 1995), and Leaving L.A. (ABC, 1997).[10]\nToussaint had her biggest and leading role alongside Annie Potts in the Lifetime first original television drama series, Any Day Now.[6] She starred in show as Rene Jackson, a successful African-American lawyer. The series has received critical acclaim for Toussaint's and Potts' acting performances and writing,[11][12][13] but never had big ratings.[14] In 2001, Toussaint was a promising contender for a Primetime Emmy Award for Outstanding Lead Actress in a Drama Series category, though she did not receive a nomination.[15] She also was nominated five times for a NAACP Image Award for Outstanding Actress in a Drama Series for her role.[6] Any Day Now ended after four-season and 88 episodes.\nFrom 2002 to 2004, Toussaint had regular role of Dr. Elaine Duchamps in the NBC police procedural, Crossing Jordan. In later years she guest-starred on Frasier, Judging Amy, The Closer, CSI: Crime Scene Investigation, ER, and NCIS. She also was regular opposite Holly Hunter in the TNT crime drama Saving Grace as Capt. Kate Perry from 2007 to 2010. She also had a recurring roles of Amelia 'Yoga' Bluman in the ABC comedy series Ugly Betty in 2006, and as Bird Merriweather in the NBC drama Friday Night Lights (2009â€“11). Toussaint appeared as Jamie Foxx's character's mother in the 2009 drama The Soloist.[16]\nIn 2012, Toussaint received critical acclaim and was nominated for an Independent Spirit Award for Best Supporting Female for her performance as a hardworking mother who struggles to support her daughter's (Emayatzy Corinealdi) decision to put her life on hold to support her incarcerated husband (Omari Hardwick), of Middle of Nowhere, a drama film written and directed by Ava DuVernay.[6][17][18] Toussaint was a promising contender for an Academy Award for Best Supporting Actress category in 2013, but she did not receive a nomination.[19][20][21] In 2012, she also guest-starred in Shonda Rhimes' dramas Grey's Anatomy as doctor, and on Scandal, as a bereaved and betrayed pastorâ€™s wife.[19] In 2013, she had a recurring role in season 3 of Dana Delany's series Body of Proof as Angela Martin, the new police chief and main villain.[22] Later in 2013, she joined the cast of ABC Family drama series, The Fosters, as Sherri Saum's character mother.[23] In show she reunited on-screen with Annie Potts in first time as of Any Day Now finale in 2002.[7]\nToussaint starred in the second season of Netflix's original comedy-drama series, Orange Is the New Black in 2014.[24][25] She played the role of Yvonne “Vee” Parker, the main antagonist of season two, described as a street-tough inmate who returns to jail after a long stint as a drug dealer. Her performance earned massive critical acclaim.[7][26][27][28][29][30] In the series Toussaint, in her 50s, appeared nude on-screen for the first time in her career.[29][31] For her performance, she won Critics' Choice Television Award for Best Supporting Actress in a Drama Series and Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Comedy Series.[32][33]\nIn 2014, Toussaint co-starred in Ava DuVernay's historical drama film Selma, playing Amelia Boynton Robinson, a leading civil rights activist who had a key role in efforts that led to passage of the Voting Rights Act, and who was the first African-American woman in Alabama to run for Congress.[34][35] That same year, she was cast in the ABC fantasy-drama series Forever opposite Ioan Gruffudd and Alana de la Garza.[36][37] The series was canceled after a single season. Toussaint co-starred in the comedy film Xmas, directed and written by Jonathan Levine, which was released on November 25, 2015.[1] In 2015, she co-starred in Runaway Island and Sophie and the Rising Sun.[38][39] Later that year, Toussaint was cast in Coco, a drama produced by Lionsgate, alongside rapper Azealia Banks.[40] In June 2015, she joined the cast of the Fox comedy-drama Rosewood in the series regular role of the titular character's mother.[41] In February 2016, Vee was ranked 28th on Rolling Stone's list of \"40 Greatest TV Villains of All Time\".[42]\nOn March 2016, Toussaint was cast in her role as defense attorney Shambala Green, a role she originated on Law & Order in 1990, on the NBC legal drama Chicago Justice, that aired a backdoor pilot in Chicago P.D..[43][44]\nOn August 14, 2017, it was announced by Deadline that Toussaint will join as a series regular in the third season of Into the Badlands. She will star in the role of Cressida, a self styled Prophetess.[45]\nToussaint has one daughter named Samara.[1] One of Toussaint's grandparents was from Haiti, while the other was from Martinique.[46] She had a blog at www.everydaylovelybylorraine.com.[47]",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"lorraine_toussaint\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Lorraine Toussaint\",\n        \"birthDate\": \"1960-04-04\",\n        \"nationality\": \"trinidadian-american\",\n        \"occupation\": \"actress and producer\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"rene_jackson\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Rene Jackson\",\n        \"role\": \"lawyer\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"any_day_now\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"Any Day Now\",\n        \"premiereDates\": \"1998\",\n        \"endDates\": \"2002\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"shambala_green\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Shambala Green\",\n        \"role\": \"defense attorney\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"law_order\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"Law & Order\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"crossing_jordan\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"Crossing Jordan\",\n        \"premiereDates\": \"2002\",\n        \"endDates\": \"2003\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"saving_grace\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"Saving Grace\",\n        \"premiereDates\": \"2007\",\n        \"endDates\": \"2010\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"middle_of_nowhere\",\n      \"label\": \"work\",\n      \"attributes\": {\n        \"name\": \"Middle of Nowhere\",\n        \"releaseDate\": \"2012\",\n        \"director\": \"Ava DuVernay\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"orange_is_the_new_black\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"Orange Is the New Black\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"vee_parker\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Yvonne \\\"Vee\\\" Parker\",\n        \"role\": \"antagonist\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"selma\",\n      \"label\": \"work\",\n      \"attributes\": {\n        \"name\": \"Selma\",\n        \"releaseDate\": \"2014\",\n        \"director\": \"Ava DuVernay\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"amelia_boynton_robinson\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Amelia Boynton Robinson\",\n        \"role\": \"civil rights activist\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"samara_toussaint\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Samara Toussaint\",\n        \"relation\": \"daughter\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"rene_jackson\",\n      \"type\": \"PLAYED_ROLE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"any_day_now\",\n      \"type\": \"STARRED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"shambala_green\",\n      \"type\": \"RECURRING_ROLE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"shambala_green\",\n      \"target\": \"law_order\",\n      \"type\": \"APPEARED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"crossing_jordan\",\n      \"type\": \"REGULAR_CAST_MEMBER\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"saving_grace\",\n      \"type\": \"REGULAR_CAST_MEMBER\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"middle_of_nowhere\",\n      \"type\": \"STARRED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"middle_of_nowhere\",\n      \"target\": \"ava_duvernay\",\n      \"type\": \"DIRECTED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"orange_is_the_new_black\",\n      \"type\": \"STARRED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"vee_parker\",\n      \"type\": \"PLAYED_ROLE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"selma\",\n      \"type\": \"STARRED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"amelia_boynton_robinson\",\n      \"type\": \"PLAYED_ROLE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"selma\",\n      \"target\": \"ava_duvernay\",\n      \"type\": \"DIRECTED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lorraine_toussaint\",\n      \"target\": \"samara_toussaint\",\n      \"type\": \"HAS_CHILD\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc58",
        "text": "General Armitage Hux[1] is a fictional character in the Star Wars franchise. First introduced in the 2015 film Star Wars: The Force Awakens, he is portrayed by Domhnall Gleeson.[2] He is a ruthless commander in a power struggle with Kylo Ren for the First Order leadership, and being exceeded only by Supreme Leader Snoke.[3] The character first featured in The Force Awakens media and merchandising, and returned in the film's sequel, Star Wars: The Last Jedi.\nHux was born on Arkanis and was rumored to have been sired from an affair between his father, Commandant Brendol Hux of the Arkanis Academy, and a kitchen worker. Hux and his father are rescued from the Academy when it is about to fall to the New Republic near the end of the Galactic Civil War. When the war ends with the Battle of Jakku and the signing of the Galactic Concordance, the young Hux and his father are part of the Imperial Navy forces who retreat into the Unknown Regions.[4] These forces later emerge as the First Order. The Republic believes that the First Order is just an unimportant band of Imperial holdouts, but Hux's training methods forge a formidable military. He also longs to use the Starkiller Base weapon against the Republic; Hux believes that the Republic is a threat to galactic stability, and that it is his destiny to rule the galaxy.\nHux first appears in The Force Awakens as the commander of the First Order. Hux is part of a mission to Jakku to recover a map to Luke Skywalker, the last Jedi. Kylo Ren leads the search for the map, which they are unable to locate. To prevent the return of the Jedi and to eliminate the Resistance, which, under the command of General Leia Organa, emerged to combat the First Order, Snoke allows Hux to use the Starkiller weapon against the Republic's capital world of Hosnian Prime. The Resistance is left without military support from the Republic, so Hux soon turns the weapon towards the Resistance base on D'Qar. Before he can destroy them, however, an attack squadron led by Commander Poe Dameron, with ground support from Han Solo, former stormtrooper Finn, and the Jakku scavenger Rey, destroys Starkiller Base, forcing Hux, his troops, and a defeated Ren to flee the planet.\nGeneral Hux appears in The Last Jedi as the primary general reporting directly to Supreme Leader Snoke. He attempts to respond to a transmission from Dameron, who pretends not to hear him and describes him as \"pasty.\" Hux then leads the subsequent battle, during which both sides sustain heavy losses. He also oversees the bombardment of the remaining three ships of the Resistance. When he discovers that Snoke is dead, he initially protests Ren's claim to be the new Supreme Leader, but is swiftly persuaded otherwise when Ren uses the Force to choke him, proclaiming \"The Supreme Leader is dead, long live the Supreme Leader.\" At the end of the film, he accompanies Ren to the planet Crait in their attempt to finish off the Resistance. When Ren orders his men to fire on Luke Skywalker, Hux admonishes him to focus on the escaping Resistance members; Ren silences him by using the Force to slam him into a wall, knocking him out.\nSome details about the backstory of Hux and his father Brendol appear in the 2016 novel Star Wars: Aftermath: Life Debt by Chuck Wendig.[1][2][4] Hux and Brendol are also characters in the 2017 novel Star Wars: Phasma by Delilah S. Dawson.[5]\nHux also is a playable Dark Side squad leader in a sequel-era update to the mobile MOBA Star Wars: Force Arena, released in late 2017.[6]\nIn his review of The Force Awakens, Henry Barnes of The Guardian wrote that Gleeson's \"screechy pseudo-Nazi role\" as General Hux is \"not as colourful or as nuanced\" as Adam Driver's part as Kylo Ren, \"but – given he's a functionary – Gleeson certainly makes an impression.\"[7] Reviewing Hux and his role in the film, David Rutz of The Washington Free Beacon wrote that while Hux is portrayed as a villain, he is shown to be a capable general and \"a committed soldier to his cause with laser-like focus on achieving the First Order's ends.\"[8]",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"general_armitage_hux\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"general armitage hux\",\n        \"role\": \"commander\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"brendol_hux\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"brendol hux\",\n        \"role\": \"commandant\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"first_order\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"first order\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"supreme_leader_snoke\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"supreme leader snoke\",\n        \"role\": \"leader\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"kylo_ren\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"kylo ren\",\n        \"role\": \"commander\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"luke_skywalker\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"luke skywalker\",\n        \"role\": \"jedi\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"leia_organa\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"leia organa\",\n        \"role\": \"general\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"resistance\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"resistance\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"starkiller_base\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"starkiller base\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"hosnian_prime\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"hosnian prime\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"dqar\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"d'qar\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"arkanis\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"arkanis\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"galactic_civil_war\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"galactic civil war\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"battle_of_jakku\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"battle of jakku\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"galactic_concordance\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"galactic concordance\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"general_armitage_hux\",\n      \"target\": \"first_order\",\n      \"type\": \"COMMANDER_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"general_armitage_hux\",\n      \"target\": \"arkania\",\n      \"type\": \"BORN_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"general_armitage_hux\",\n      \"target\": \"brendol_hux\",\n      \"type\": \"CHILD_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"brendol_hux\",\n      \"target\": \"arkanis\",\n      \"type\": \"ASSOCIATED_WITH\",\n      \"attributes\": {\n        \"role\": \"commandant\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"first_order\",\n      \"target\": \"starkiller_base\",\n      \"type\": \"BASE_OF\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"first_order\",\n      \"target\": \"supreme_leader_snoke\",\n      \"type\": \"LEAD_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"first_order\",\n      \"target\": \"kylo_ren\",\n      \"type\": \"IN_CONFLICT_WITH\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"first_order\",\n      \"target\": \"resistance\",\n      \"type\": \"IN_CONFLICT_WITH\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"resistance\",\n      \"target\": \"leia_organa\",\n      \"type\": \"LEAD_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"starkiller_base\",\n      \"target\": \"hosnian_prime\",\n      \"type\": \"TARGETED\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"starkiller_base\",\n      \"target\": \"dqar\",\n      \"type\": \"TARGETED\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"galactic_civil_war\",\n      \"target\": \"battle_of_jakku\",\n      \"type\": \"ENDED_WITH\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"battle_of_jakku\",\n      \"target\": \"galactic_concordance\",\n      \"type\": \"FOLLOWED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc66",
        "text": "Chinese New Year,[a][2] also known as the Spring Festival in modern China,[b] is an important Chinese festival celebrated at the turn of the traditional lunisolar Chinese calendar. It is one of several Lunar New Years in Asia. Celebrations traditionally run from the evening preceding the first day, to the Lantern Festival on the 15th day of the first calendar month. The first day of the New Year falls on the new moon between January 21 and February 20[3] In 2018, the first day of the Lunar New Year was on Friday, 16 February, initiating the year of the Dog.\nIt is one of the world's most prominent and celebrated festivals, and involves the largest annual mass human migration in the world. It is a major holiday in Greater China and has strongly influenced the lunar new year celebrations of China's neighbouring cultures, including the Korean New Year (seol), the Tết of Vietnam, and the Losar of Tibet.[4] It is also celebrated worldwide in countries with significant Overseas Chinese populations, including Singapore,[5] Indonesia, Malaysia, Thailand, Cambodia, Australia, the Philippines[6][7] and  Mauritius,[8] as well as many countries in North America and Europe.[9][10][11]\nThe New Year festival is centuries old and associated with several myths and customs. Traditionally, the festival was a time to honour deities as well as ancestors.[12] Within China, regional customs and traditions concerning the celebration of the Lunar New Year vary widely. Often, the evening preceding Lunar New Year's Day is an occasion for Chinese families to gather for the annual reunion dinner. It is also traditional for every family to thoroughly clean the house, in order to sweep away any ill-fortune and to make way for incoming good luck.  Windows and doors are decorated with red colour paper-cuts and couplets with popular themes of \"good fortune\" or \"happiness\", \"wealth\", and \"longevity\". Other activities include lighting firecrackers and giving money in red paper envelopes.  In about one third of the Mainland population, or 500 million Northerners, dumplings (especially those of vegetarian fillings) feature prominently in the meals celebrating the festival.\nThe lunisolar Chinese calendar determines the date of Lunar New Year. The calendar is also used in countries that have been influenced by, or have relations with, China – such as Korea, Japan and Vietnam, though occasionally the date celebrated may differ by one day or even one moon cycle due to using a meridian based on a different capital city in a different time zone or different placements of intercalary months.[14]\nChinese calendar defines the lunar month with winter solstice as the 11th month, which means that Chinese New Year usually falls on the second new moon after the winter solstice (rarely the third if an intercalary month intervenes).[2] In more than 96% of the years, the Chinese New Year's Day is the closest new moon to lichun (Chinese: 立春; \"start of spring\") on 4 or 5 February, and the first new moon after Dahan (Chinese: 大寒; \"major cold\"). In the Gregorian calendar, the Lunar New Year begins at the new moon that falls between 21 January and 20 February.[13][verification needed]\nThe Gregorian Calendar dates for Chinese New Year from 1912 to 2101 are below, along with the year's presiding animal zodiac and its Stem-branch. The traditional Chinese calendar follows a Metonic cycle (like the modern Jewish Calendar), and returns to the same date in Gregorian calendar roughly. The names of the Earthly Branches have no English counterparts and are not the Chinese translations of the animals.  Alongside the 12-year cycle of the animal zodiac there is a 10-year cycle of heavenly stems. Each of the ten heavenly stems is associated with one of the five elements of Chinese astrology, namely: Wood, Fire, Earth, Metal, and Water. The elements are rotated every two years while a yin and yang association alternates every year. The elements are thus distinguished: Yang Wood, Yin Wood, Yang Fire, Yin Fire, etc. These produce a combined cycle that repeats every 60 years.  For example, the year of the Yang Fire Rat occurred in 1936 and in 1996, 60 years apart.\nMany people inaccurately calculate their Chinese birth-year by converting it from their Gregorian birth-year. As the Chinese New Year starts in late January to mid-February, the previous Chinese year dates through 1 January until that day in the new Gregorian year, remaining unchanged from the previous Gregorian year. For example, the 1989 year of the Snake began on 6 February 1989. The year 1989 is generally aligned with the year of the Snake. However, the 1988 year of the Dragon officially ended on 5 February 1989. This means that anyone born from 1 January to 5 February 1989 was actually born in the year of the Dragon rather than the year of the Snake. Many online Chinese Sign calculators do not account for the non-alignment of the two calendars, using Gregorian-calendar years rather than official Chinese New Year dates.[15]\nOne scheme of continuously numbered Chinese-calendar years assigns 4709 to the year beginning, 2011, but this is not universally accepted; the calendar is traditionally cyclical, not continuously numbered.\nAlthough the Chinese calendar traditionally does not use continuously numbered years, outside China its years are sometimes numbered from the purported reign of the mythical Yellow Emperor in the 3rd millennium BCE. But at least three different years numbered 1 are now used by various scholars, making the year beginning CE 2015 the \"Chinese year\" 4712, 4713, or 4652.[16]\nAccording to tales and legends, the beginning of the Chinese New Year started with a mythical beast called the Nian. Nian would eat villagers, especially children. One year, all the villagers decided to go hide from the beast. An old man appeared before the villagers went into hiding and said that he's going to stay the night, and decided to get revenge on the Nian. All the villagers thought he was insane. The old man put red papers up and set off firecrackers. The day after, the villagers came back to their town to see that nothing was destroyed. They assumed that the old man was a deity who came to save them. The villagers then understood that the Nian was afraid of the color red and loud noises. When the New Year was about to come, the villagers would wear red clothes, hang red lanterns, and red spring scrolls on windows and doors. People also used firecrackers to frighten away the Nian. From then on, Nian never came to the village again. The Nian was eventually captured by Hongjun Laozu, an ancient Taoist monk. After that, Nian retreated to a nearby mountain. The name of the mountain has long been lost over the years.[17]\nChinese New Year is observed as a public holiday in a number of countries and territories where there is a sizable Chinese population. Since Chinese New Year falls on different dates on the Gregorian calendar every year on different days of the week, some of these governments opt to shift working days in order to accommodate a longer public holiday. In some countries, a statutory holiday is added on the following work day when the New Year falls on a weekend, as in the case of 2013, where the New Year's Eve (9 February) falls on Saturday and the New Year's Day (10 February) on Sunday. Depending on the country, the holiday may be termed differently; common names are \"Chinese New Year\", \"Lunar New Year\", \"New Year Festival\", and \"Spring Festival\".\nFor New Year celebrations that are lunar but not based on the Chinese New Year (such as Korea's Seollal and Vietnam's Tết), see the article on Lunar New Year.\nFor other countries where Chinese New Year is celebrated but not an official holiday, see the section below on Festivities outside China.\nDuring the festival, people around China will prepare different gourmet for families and guests. Influenced by the flourished cultures, foods from different places look and taste totally different. Among them, the most well-known ones are dumplings from northern China and Tangyuan from southern China.\nOn the eighth day of the lunar month prior to Chinese New Year, the Laba holiday (simplified Chinese: 腊八; traditional Chinese: 臘八; pinyin: làbā), a traditional porridge, Laba porridge (simplified Chinese: 腊八粥; traditional Chinese: 臘八粥; pinyin: làbā zhōu), is served in remembrance of an ancient festival, called La, that occurred shortly after the winter solstice.[35] Pickles such as Laba garlic, which turns green from vinegar, are also made on this day. For those that believe in Buddhism, the Laba holiday is also considered Bodhi Day. Layue (simplified Chinese: 腊月; traditional Chinese: 臘月; pinyin: Làyuè) is a term often associated with Chinese New Year as it refers to the sacrifices held in honor of the gods in the twelfth lunar month, hence the cured meats of Chinese New Year are known as larou (simplified Chinese: 腊肉; traditional Chinese: 臘肉; pinyin: làròu). The porridge was prepared by the women of the household at first light, with the first bowl offered to the family's ancestors and the household deities. Every member of the family was then served a bowl, with leftovers distributed to relatives and friends.[36] It's still served as a special breakfast on this day in some Chinese homes. The concept of the \"La month\" is similar to Advent in Christianity. Many families eat vegetarian on Chinese New Year eve, the garlic and preserved meat are eaten on Chinese New Year day.\nOn the days immediately before the New Year celebration, Chinese families give their homes a thorough cleaning. There is a Cantonese saying \"Wash away the dirt on nin ya baat\" (Chinese: 年廿八，洗邋遢; pinyin: nián niàn bā, xǐ lātà; Jyutping: nin4 jaa6 baat3, sai2 laap6 taap3 (laat6 taat3)), but the practice is not restricted to nin ya baat (the 28th day of month 12). It is believed the cleaning sweeps away the bad luck of the preceding year and makes their homes ready for good luck. Brooms and dust pans are put away on the first day so that the newly arrived good luck cannot be swept away.  Some people give their homes, doors and window-frames a new coat of red paint; decorators and paper-hangers do a year-end rush of business prior to Chinese New Year.[37] Homes are often decorated with paper cutouts of Chinese auspicious phrases and couplets. Purchasing new clothing and shoes also symbolize a new start. Any hair cuts need to be completed before the New Year, as cutting hair on New Year is considered bad luck due to the homonymic nature of the word \"hair\" (fa) and the word for \"prosperity\". Businesses are expected to pay off all the debts outstanding for the year before the new year eve, extending to debts of gratitude. Thus it is a common practice to send gifts and rice to close business associates, and extended family members.\nIn many households where Buddhism or Taoism is prevalent, home altars and statues are cleaned thoroughly, and decorations used to adorn altars over the past year are taken down and burned a week before the new year starts, to be replaced with new decorations. Taoists (and Buddhists to a lesser extent) will also \"send gods back to heaven\" (Chinese: 送神; pinyin: sòngshén), an example would be burning a paper effigy of Zao Jun the Kitchen God, the recorder of family functions. This is done so that the Kitchen God can report to the Jade Emperor of the family household's transgressions and good deeds. Families often offer sweet foods (such as candy) in order to \"bribe\" the deities into reporting good things about the family.\nPrior to the Reunion Dinner, a prayer of thanksgiving is held to mark the safe passage of the previous year. Confucianists take the opportunity to remember their ancestors, and those who had lived before them are revered. Some people do not give a Buddhist prayer due to the influence of Christianity, with a Christian prayer offered instead.\nThe biggest event of any Chinese New Year's Eve is the annual reunion dinner. Dishes consisting of special meats are served at the tables, as a main course for the dinner and offering for the New Year. This meal is comparable to Thanksgiving dinner in the U.S. and remotely similar to Christmas dinner in other countries with a high percentage of Christians.\nIn northern China, it is customary to make dumplings (jiaozi) after dinner to eat around midnight. Dumplings symbolize wealth because their shape resembles a Chinese sycee. In contrast, in the South, it is customary to make a glutinous new year cake (niangao) and send pieces of it as gifts to relatives and friends in the coming days. Niángāo [Pinyin] literally means \"new year cake\" with a homophonous meaning of \"increasingly prosperous year in year out\".[38]\nAfter dinner, some families go to local temples hours before the new year begins to pray for a prosperous new year by lighting the first incense of the year; however in modern practice, many households hold parties and even hold a countdown to the new year. Traditionally, firecrackers were lit to scare away evil spirits with the household doors sealed, not to be reopened until the new morning in a ritual called \"opening the door of fortune\" (simplified Chinese: 开财门; traditional Chinese: 開財門; pinyin: kāicáimén).[39]\nBeginning in 1982, the CCTV New Year's Gala is broadcast in China four hours before the start of the New Year and lasts until the succeeding early morning. A tradition of going to bed late on New Year's Eve, or even keeping awake the whole night and morning, known as shousui (守岁), is still practised as it is thought to add on to one's parents' longevity.\nThe first day is for the welcoming of the deities of the heavens and earth, officially beginning at midnight. It is a traditional practice to light fireworks, burn bamboo sticks and firecrackers and to make as much of a din as possible to chase off the evil spirits as encapsulated by nian  of which the term Guo Nian was derived. Many Buddhists abstain from meat consumption on the first day because it is believed to ensure longevity for them. Some consider lighting fires and using knives to be bad luck on New Year's Day, so all food to be consumed is cooked the days before. On this day, it is considered bad luck to use the broom, as good fortune is not to be \"swept away\" symbolically.\nMost importantly, the first day of Chinese New Year is a time to honor one's elders and families visit the oldest and most senior members of their extended families, usually their parents, grandparents and great-grandparents.\nFor Buddhists, the first day is also the birthday of Maitreya Bodhisattva (better known as the more familiar Budai Luohan), the Buddha-to-be. People also abstain from killing animals.\nSome families may invite a lion dance troupe as a symbolic ritual to usher in the Chinese New Year as well as to evict bad spirits from the premises. Members of the family who are married also give red envelopes containing cash known as lai see (Cantonese dialect) or angpow (Hokkien dialect/Fujian), or hongbao (Mandarin), a form of blessings and to suppress the aging and challenges associated with the coming year, to junior members of the family, mostly children and teenagers. Business managers also give bonuses through red packets to employees for good luck, smooth-sailing, good health and wealth.\nWhile fireworks and firecrackers are traditionally very popular, some regions have banned them due to concerns over fire hazards. For this reason, various city governments (e.g., Kowloon, Beijing, Shanghai for a number of years) issued bans over fireworks and firecrackers in certain precincts of the city. As a substitute, large-scale fireworks display have been launched by governments in such city-states as Hong Kong and Singapore. However, it is a tradition that the indigenous peoples of the walled villages of New Territories, Hong Kong are permitted to light firecrackers and launch fireworks in a limited scale.\nThe second day of the Chinese New Year, known as \"beginning of the year\" (simplified Chinese: 开年; traditional Chinese: 開年; pinyin: kāinián),[40] was when married daughters visited their birth parents, relatives and close friends. (Traditionally, married daughters didn't have the opportunity to visit their birth families frequently.)\nDuring the days of imperial China, \"beggars and other unemployed people circulate[d] from family to family, carrying a picture [of the God of Wealth] shouting, \"Cai Shen dao!\" [The God of Wealth has come!].\"[41] Householders would respond with \"lucky money\" to reward the messengers. Business people of the Cantonese dialect group will hold a 'Hoi Nin' prayer to start their business on the 2nd day of Chinese New Year so they will be blessed with good luck and prosperity in their business for the year.\nAs this day is believed to be The Birthday of Che Kung, a deity worshipped in Hong Kong, worshippers go to Che Kung Temples to pray for his blessing. A representative from the government asks Che Kung about the city's fortune through kau cim.\nThe third day is known as \"red mouth\" (Chinese: 赤口; pinyin: Chìkǒu). Chikou is also called \"Chigou's Day\" (Chinese: 赤狗日; pinyin: Chìgǒurì). Chigou, literally \"red dog\", is an epithet of \"the God of Blazing Wrath\" (Chinese: 熛怒之神; pinyin: Biāo nù zhī shén). Rural villagers continue the tradition of burning paper offerings over trash fires. It is considered an unlucky day to have guests or go visiting.[42][43] Hakka villagers in rural Hong Kong in the 1960s called it the Day of the Poor Devil and believed everyone should stay at home.[44] This is also considered a propitious day to visit the temple of the God of Wealth and have one's future told.\nIn those communities that celebrate Chinese New Year for 15 days, the fourth day is when corporate \"spring dinners\" kick off and business returns to normal. Other areas that have a longer Chinese New Year holiday will celebrate and welcome the gods that were previously sent on this day.\nThis day is the god of Wealth's birthday. In northern China, people eat jiaozi, or dumplings, on the morning of powu (Chinese: 破五; pinyin: pòwǔ). In Taiwan, businesses traditionally re-open on the next day (the sixth day), accompanied by firecrackers.\nIt is also common in China that on the 5th day people will shoot off firecrackers to get Guan Yu's attention, thus ensuring his favor and good fortune for the new year.[45]\nThe seventh day, traditionally known as Renri (the common person's birthday), is the day when everyone grows one year older. In some overseas Chinese communities in Southeast Asia, such as Malaysia and Singapore, it is also the day when tossed raw fish salad, yusheng, is eaten for continued wealth and prosperity.\nFor many Chinese Buddhists, this is another day to avoid meat, the seventh day commemorating the birth of Sakra, lord of the devas in Buddhist cosmology who is analogous to the Jade Emperor.\nAnother family dinner is held to celebrate the eve of the birth of the Jade Emperor, the ruler of heaven. People normally return to work by the eighth day, therefore the Store owners will host a lunch/dinner with their employees, thanking their employees for the work they have done for the whole year.\nApproaching 12 midnight on this day, Hokkien people prepare for the \"Jade Emperor ritual\" (Hokkien: 拜天公 Pài Thiⁿ-kong) during which incense is burnt and food offerings made to the Jade Emperor and also to Zao Jun, the Kitchen god who reports on each family to the Jade Emperor.\nSome people will hold a ritual prayer after midnight on the eighth day. In Malaysia, especially, people light fireworks, often more than on the first day.\nThis practice of Bai Ti Gong can also be seen in Singapore and Indonesia, especially in Hokkien-speaking Chinese areas like Sumatra.\nThe ninth day of the New Year is a day for Chinese to offer prayers to the Jade Emperor of Heaven in the Daoist Pantheon.[46] The ninth day is traditionally the birthday of the Jade Emperor. This day, called Ti Kong Dan (Hokkien: 天公诞 Thiⁿ-kong Tan), Ti Kong Si (Hokkien: 天公生 Thiⁿ-kong Siⁿ) or Pai Ti Kong (Hokkien: 拜天公 Pài Thiⁿ-kong), is especially important to Hokkiens, even more important than the first day of the Chinese New Year.[47]\nCome midnight of the eighth day of the new year, Hokkiens will offer thanks to the Emperor of Heaven. A prominent requisite offering is sugarcane.[47] Legend holds that the Hokkien were spared from a massacre by Japanese pirates by hiding in a sugarcane plantation during the eighth and ninth days of the Chinese New Year, coinciding with the Jade Emperor's birthday.[47] Since \"sugarcane\" (Hokkien:  甘蔗 kam-chià) is a near homonym to \"thank you\" (Hokkien:  感謝 kám-siā) in the Hokkien dialect, Hokkiens offer sugarcane on the eve of his birthday, symbolic of their gratitude.[47]\nIn the morning of this birthday (traditionally anytime from midnight to 7 am), Taiwanese households set up an altar table with 3 layers: one top (containing offertories of six vegetables (Chinese: 六齋; pinyin: liù zhāi), noodles, fruits, cakes, tangyuan, vegetable bowls, and unripe betel, all decorated with paper lanterns) and two lower levels (containing the five sacrifices and wines) to honor the deities below the Jade Emperor.[46] The household then kneels three times and kowtows nine times to pay obeisance and wish him a long life.[46]\nIncense, tea, fruit, vegetarian food or roast pig, and gold paper is served as a customary protocol for paying respect to an honored person.\nThe Jade Emperor's party is celebrated on this day.\nThe fifteenth day of the new year is celebrated as \"Yuanxiao Festival\" (simplified Chinese: 元宵节; traditional Chinese: 元宵節; pinyin: Yuán xiāo jié), also known as \"Shangyuan Festival\" (simplified Chinese: 上元节; traditional Chinese: 上元節; pinyin: Shàng yuán jié) or the Lantern Festival (otherwise known as Chap Goh Mei Chinese: 十五暝; pinyin: Shíwǔmíng; literally: \"the fifteen night\" in Fujian dialect). Rice dumplings tangyuan (simplified Chinese: 汤圆; traditional Chinese: 湯圓; pinyin: tang yuán), a sweet glutinous rice ball brewed in a soup, are eaten this day.  Candles are lit outside houses as a way to guide wayward spirits home.  This day is celebrated as the Lantern Festival, and families walk the street carrying lighted lanterns.\nIn China, Malaysia, and Singapore, this day is celebrated by individuals seeking a romantic partner, akin to Valentine's Day.[48] Nowadays, single women write their contact number on mandarin oranges and throw them in a river or a lake after which single men collect the oranges and eat them. The taste is an indication of their possible love: sweet represents a good fate while sour represents a bad fate.\nThis day often marks the end of the Chinese New Year festivities.\nA reunion dinner, named as \"Nian Ye Fan\", is held on New Year's Eve during which family members gather for a celebration. The venue will usually be in or near the home of the most senior member of the family. The New Year's Eve dinner is very large and sumptuous and traditionally includes dishes of meat (namely, pork and chicken) and fish. Most reunion dinners also feature a communal hot pot as it is believed to signify the coming together of the family members for the meal. Most reunion dinners (particularly in the Southern regions) also prominently feature specialty meats (e.g. wax-cured meats like duck and Chinese sausage) and seafood (e.g. lobster and abalone) that are usually reserved for this and other special occasions during the remainder of the year. In most areas, fish (traditional Chinese: 魚; simplified Chinese: 鱼; pinyin: yú) is included, but not eaten completely (and the remainder is stored overnight), as the Chinese phrase \"may there be surpluses every year\" (traditional Chinese: 年年有餘; simplified Chinese: 年年有余; pinyin: niánnián yǒu yú) sounds the same as \"let there be fish every year.\" Eight individual dishes are served to reflect the belief of good fortune associated with the number. If in the previous year a death was experienced in the family, seven dishes are served.\nRed packets for the immediate family are sometimes distributed during the reunion dinner. These packets often contain money in certain numbers that reflect good luck and honorability. Several foods are consumed to usher in wealth, happiness, and good fortune. Several of the Chinese food names are homophones for words that also mean good things.\nLike many other New Year dishes, certain ingredients also take special precedence over others as these ingredients also have similar-sounding names with prosperity, good luck, or even counting money.\nIn 1928, the ruling Kuomintang party in China decreed that Chinese New Year will fall on 1 Jan of the Gregorian Calendar, but this was abandoned due to overwhelming opposition from the populace. In 1967 during the Cultural Revolution, official Chinese New Year celebrations were banned in China. The State Council of the People's Republic of China announced that the public should  \"Change Customs\", have a \"revolutionized and fighting Spring Festival\", and since people needed to work on Chinese New Year Eve, they didn't have holidays during Spring Festival day. The public celebrations were reinstated by the time of the Chinese economic reform.[51]\nTraditionally, red envelopes or red packets \n(Cantonese: lai sze or lai see; 利是, 利市 or 利事; Pinyin: lìshì; Mandarin: hóngbāo 红包; Hokkien: ang pow; POJ: âng-pau; Hakka: fung bao) are passed out during the Chinese New Year's celebrations, from married couples or the elderly to unmarried juniors. It is also common for adults or young couples to give red packets to children.\nDuring this period, red packets are also known as 壓歲錢/压岁钱 (yàsuìqián, which was evolved from 壓祟錢/压祟钱, literally, \"the money used to suppress or put down the evil spirit\").[52]\nRed packets almost always contain money, usually varying from a couple of dollars to several hundred. Per custom, the amount of money in the red packets should be of even numbers, as odd numbers are associated with cash given during funerals (帛金: báijīn). The number 8 is considered lucky (for its homophone for \"wealth\"), and $8 is commonly found in the red envelopes in the US. The number six (六, liù) is also very lucky as it sounds like \"smooth\" (流, liú), in the sense of having a smooth year. The number four (四) is the worst because its homophone is \"death\" (死). Sometimes chocolate coins are found in the red packets.\nOdd and even numbers are determined by the first digit, rather than the last. Thirty and fifty, for example, are odd numbers and are thus appropriate as funeral cash gifts. However, it is common and quite acceptable to have cash gifts in a red packet using a single bank note – with ten or fifty yuan bills used frequently. It is customary for the bills to be brand new printed money. Everything regarding the New Year has to be new in order to have good luck and fortune.\nThe act of asking for red packets is normally called (Mandarin): 讨紅包 tǎo-hóngbāo, 要利是 or (Cantonese): 逗利是. A married person would not turn down such a request as it would mean that he or she would be \"out of luck\" in the new year. Red packets are generally given by established married couples to the younger non-married children of the family. It is custom and polite for children to wish elders a happy new year and a year of happiness, health and good fortune before accepting the red envelope. Red envelopes are then kept under the pillow and slept on for seven nights after Chinese New Year before opening because that symbolizes good luck and fortune.\nIn Taiwan in the 2000s, some employers also gave red packets as a bonus to maids, nurses or domestic workers from Southeast Asian countries, although whether this is appropriate is controversial.[53][54]\nThe Japanese have a similar tradition of giving money during the New Year, called Otoshidama.\nIn addition to red envelopes, which are usually given from older people to younger people, small gifts (usually food or sweets) are also exchanged between friends or relatives (of different households) during Chinese New Year. Gifts are usually brought when visiting friends or relatives at their homes. Common gifts include fruits (typically oranges, and never pears), cakes, biscuits, chocolates, and candies.\nCertain items should not be given, as they are considered taboo. Taboo gifts include:[55][56][57]\nMarkets or village fairs are set up as the New Year is approaching. These usually open-air markets feature new year related products such as flowers, toys, clothing, and even fireworks and firecrackers. It is convenient for people to buy gifts for their new year visits as well as their home decorations. In some places, the practice of shopping for the perfect plum tree is not dissimilar to the Western tradition of buying a Christmas tree.\nHong Kong filmmakers also release \"New Year celebration films\" (賀歲片), mostly comedies, at this time of year.\nBamboo stems filled with gunpowder that was burnt to create small explosions were once used in ancient China to drive away evil spirits. In modern times, this method has eventually evolved into the use of firecrackers during the festive season. Firecrackers are usually strung on a long fused string so it can be hung down. Each firecracker is rolled up in red papers, as red is auspicious, with gunpowder in its core. Once ignited, the firecracker lets out a loud popping noise and, as they are usually strung together by the hundreds, the firecrackers are known for their deafening explosions that are thought to scare away evil spirits. The burning of firecrackers also signifies a joyful time of year and has become an integral aspect of Chinese New Year celebrations.[58]\nThe use of firecrackers, although a traditional part of the celebration, has over the years led to many unfortunate outcomes. There have been reported incidents every year of users of fireworks being blinded, losing body parts, or suffering other grievous injuries, especially during the Chinese New Year season. Hence, many governments and authorities eventually enacted laws completely banning the use of firecrackers privately, primarily because of safety issues.\n\"Happy New Year!\" (Chinese: 新年好呀; pinyin: Xīn Nián Hǎo Ya; literally: \"New Year's Good, Ya\") is a popular children's song for the New Year holiday.[66] The melody is similar to the American folk song, Oh My Darling, Clementine.\nClothing mainly featuring the color red or bright colors is commonly worn throughout the Chinese New Year because it was once believed that red could scare away evil spirits and bad fortune. In addition, people typically wear new clothes from head to toe to symbolize a new beginning in the new year. Wearing new clothes also symbolizes having more than enough things to use and wear in the new year. Red is a color of good luck.\nIn some places, the taking of a family portrait is an important ceremony after the relatives are gathered. The photo is taken at the hall of the house or taken in front of the house. The most senior male head of the family sits in the center.\nAs with all cultures, Chinese New Year traditions incorporate elements that are symbolic of deeper meaning.  One common example of Chinese New Year symbolism is the red diamond-shaped fu characters (Chinese: 福; pinyin: fú; Cantonese Yale: fuk1; literally: \"blessings, happiness\"), which are displayed on the entrances of Chinese homes. This sign is usually seen hanging upside down, since the Chinese word dao (Chinese: 倒; pinyin: dào; literally: \"upside down\"), is homophonous or nearly homophonous with (Chinese: 到; pinyin: dào; literally: \"arrive\") in all varieties of Chinese. Therefore, it symbolizes the arrival of luck, happiness, and prosperity.\nFor the Cantonese-speaking people, if the fu sign is hung upside down, the implied dao (upside down) sounds like the Cantonese word for \"pour\", producing \"pour the luck [away]\", which would usually symbolize bad luck; this is why the fu character is not usually hung upside-down in Cantonese communities.\nRed is the predominant color used in New Year celebrations. Red is the emblem of joy, and this color also symbolizes virtue, truth and sincerity. On the Chinese opera stage, a painted red face usually denotes a sacred or loyal personage and sometimes a great emperor. Candies, cakes, decorations and many things associated with the New Year and its ceremonies are colored red. The sound of the Chinese word for \"red\" (simplified Chinese: 红; traditional Chinese: 紅; pinyin: hóng; Cantonese Yale: hung4) is in Mandarin homophonous with the word for \"prosperous\". Therefore, red is an auspicious color and has an auspicious sound.\nNianhua can be a form of Chinese colored woodblock printing, for decoration during Chinese New Year.[67]\nThe following are popular floral decorations for the New Year and are available at new year markets.\nTraditionally, families gather together during the Chinese New Year. In modern China, migrant workers in China travel home to have reunion dinners with their families on Chinese New Year's Eve. Owing to a large number of interprovincial travelers, special arrangements were made by railways, buses and airlines starting from 15 days before the New Year's Day. This 40-day period is called chunyun, and is known as the world's largest annual migration.[68] More interurban trips are taken in mainland China in this period than the total population of China.\nIn Taiwan, spring travel is also a major event. The majority of transportation in western Taiwan is in a north-south direction: long distance travel between urbanized north and hometowns in the rural south. Transportation in eastern Taiwan and that between Taiwan and its islands is less convenient. Cross-strait flights between Taiwan and mainland China began in 2003 as part of Three Links, mostly for \"Taiwanese businessmen\" to return to Taiwan for the new year.[69]\nChinese New Year is also celebrated annually in many countries with significant Chinese populations. These include countries throughout Asia, Oceania, and North America. Sydney,[70] London,[71] and San Francisco[72] claim to host the largest New Year celebration outside of Asia and South America.\nIn some countries of Southeast Asia, Chinese New Year is a national public holiday and considered to be one of the most important holidays of the year. Chinese New Year's Eve is typically a half-day holiday for Malaysia and Singapore. The biggest celebrations take place in Malaysia (notably in Kuala Lumpur, George Town and Klang) and Singapore.[73]\nIn Singapore, Chinese New Year is accompanied by various festive activities. One of the main highlights is the Chinatown celebrations. In 2010, this included a Festive Street Bazaar, nightly staged shows at Kreta Ayer Square and a lion dance competition.[74] The Chingay Parade also features prominently in the celebrations. It is an annual street parade in Singapore, well known for its colorful floats and wide variety of cultural performances.[75] The highlights of the Parade for 2011 include a Fire Party, multi-ethnic performances and an unprecedented travelling dance competition.[76]\nIn Philippines, Chinese New Year is considered to be the most important festival for Filipino-Chinese, and its celebration has also extended to the non-Chinese majority Filipinos. In 2012, Chinese New Year was included in public holidays in the Philippines, which is only the New Year's Day itself.\nIn Indonesia, the Chinese New Year is officially named as Hari Tahun Baru Imlek,[77][78][79] or Sin Cia in Hokkien.[80] It was celebrated as one of the official national religious holiday by Chinese-Indonesians since 18 June 1946 to 1 January 1953 through government regulation signed by President Sukarno on 18 June 1946.[77][81] It was unofficially celebrated by ethnic Chinese from 1953 to 1967 based on government regulation signed by Vice President Muhammad Hatta in 5 February 1953 which annul the previous regulation, among others, the Chinese New Year as a national religious holiday,.[77][82] Effectively from 6 December 1967,[83] until 1998,[84] the spiritual practice to celebrate the Chinese New Year by Chinese families was restricted specifically only inside of the Chinese house. This restriction is made by Indonesian government through a Presidential Instruction, Instruksi Presiden No.14 Tahun 1967, signed by President Suharto. This restriction is ended when the regime has changed and the President Suharto was overthrown.[85] The celebration is conducted unofficially by Chinese community from 1999 to 2000. On 17 January 2000, the President Abdurrahman Wahid issued a Presidential Decree through Keputusan Presiden RI No 6 Tahun 2000 to annul Instruksi Presiden No.14 Tahun 1967.[86] On 19 January 2001, the Ministry of Religious Affairs (Kementerian Agama Republik Indonesia) issued a Decree through Keputusan Menteri Agama RI No 13 Tahun 2001 tentang Imlek sebagai Hari Libur Nasional to set of Hari Tahun Baru Imlek as a Facultative Holiday for Chinese Community.[77][87]  Through the Presidential Decree it was officially declared as a 1 (one) day public religious holiday as of 9 April 2002 by President Megawati.[79] The Indonesian government authorize only the first day of the Chinese New Year as a public religious holiday and it is specifically designated only for Chinese people.[77][78][79][81][82][88][89] In Indonesia, the first day of the Chinese New Year is recognized as a part of the celebration of the Chinese religion and tradition of Chinese community.[78][79][81][82][87] There are no other official or unofficial of the Chinese New Year as a public holiday. The remaining 14 days are celebrated only by ethnic Chinese families.[77][90] In Indonesia, the Chinese Year is named as a year of Kǒngzǐ (孔子) or Kongzili in Bahasa Indonesia. Every year, the Ministry of Religious Affairs (Kementerian Agama Republik Indonesia) set the specific date of religious holiday based on input from religious leaders.[90] The Chinese New Year is the only national religious holiday in Indonesia that was enacted specifically with the Presidential Decree, in this case with the Keputusan Presiden Republik Indonesia (Keppres RI) No 19 Tahun 2002 dated on 9 April 2002.[78][79] The celebration of the Chinese New Year as a religious holiday is specifically intended only for Chinese People in Indonesia (tradisi masyarakat Cina yang dirayakan secara turun temurun di berbagai wilayah di Indonesia,[79] dan umat Agama Tionghoa[81]) and it is not intended to be celebrated by Indonesian Indigenous Peoples or Masyarakat Pribumi Indonesia.[78][79][81][82][83][87]\nOddly and funny, most Chinese-Indonesian who are not adhere to Chinese religion thinks and believes that the Chinese New Year is only for one day, in this case is on the first day, and the remaining day especially on the fifteenth day is not considered as a part of Chinese New Year. The same things is happening to Indonesian Indigenous peoples who insists that the fifteenth day of the Chinese New Year is a kind of jamboree or carnival and thinks it has not related with Chinese New Year at all. It is believed that this behaviour occurs because of the religion dilemma where mostly a majority of Indigenous peoples in Indonesia are religious thus by denying that the Chinese New Year activities are not related with any of religion then they can make a justification to participate and celebrate the Chinese New Year especially on the fifteenth day of the celebration. Their primary motives to participate the Chinese New Year festival and Chinese religion activities are money from carrying the Chinese gods statues, playing the lion and dragon dance and free foods, and the opportunity to meet and seeking a Chinese partner for marriages. Some are even trying to find a mate to have a sexual intercourse during the festival. A large number of Non-Chinese men are even continue to come to the Chinese temple on a regular basis to pray to the Chinese deities and wishing to get for an ethnic Chinese woman as a wife. Some have succeed in marrying with ethnic Chinese. Sadly, all of the descendant of this mix-marriages claim that they have a pure blood of Chinese descendant. By marrying a Chinese, and actively participate as a follower of Chinese religion and thus to get into the deep of the inside environment of ethnic Chinese family inner-circle, the Non-Chinese people believed that they can upgrade their social and financial status instantly. To disguise their identity many changed their Indonesian name into Chinese look-alike name and falsified their ancestral history family tree. A lot of Non-Chinese people who have married also put in their children to Chinese temple[91] and Chinese school with the hope that as they grow-up they have the first opportunity to marry with the Chinese. After marrying with Chinese people, most of the Non-Chinese people, if not all, including their children are always claiming and insists that they have a pure blood of a Chinese descendant, consequently, mostly, if not all, the Chinese people itself in Indonesia, because of lack of comparisons, can not differentiate who is a Chinese and who is not.[92][93] Furthermore, because of this ignorance, more and more of Chinese people in Indonesia thinks they are already marrying with a Chinese because they have met at the Chinese temple. They assume that only Chinese people goes to the Chinese temple, but the truth is not. No wonder that at least 90%, if not all, of Chinese-Indonesian who claimed that they have a pure blood of Chinese have a very different skin complexion, and a different physical characteristics with an odd facial features compares with the other Chinese people in the world. Everyone even want to claim that they are a Chinese descendant even though their DNA is not a Chinese at all. This phenomenon explains why there are crowds on every Chinese New Year events and roughly 90% of Chinese temple visitors in some places are Indonesian Indigenous peoples and a descendant of a mix-marriages even though the Chinese community only accounted for 1,2Â %,[94] of Indonesian population. Some of Non-Chinese and Chinese people are also celebrated Chinese New Year inside a Church with dragon dance, incense for praying and food offerings to Mary, Mother of Jesus and Jesus Christ.[95][96][97] Because of the majority of Chinese temple congregation are Non-Chinese people, consequently they are also bringing their own culture, customs, beliefs and ritual of worship of their gods to be practiced inside the Chinese temple,[98][99] thus in some parts of Indonesia the practice of Chinese religion and Chinese New Year would be totally different with the other Chinese community in the other parts of the world.[91][100][101][102][103][104][105] Some of Non-Chinese people who have a deep knowledge of Chinese religion is becoming the Chinese religious leaders and routinely gives preaching to Chinese community. Some are even becoming the chairman and the leaders of the Chinese religious association.[106][107] There are tons of evidence supporting the above statements, anyone who want to pursue further about this matter is encouraged to go to Facebook.com and do research using the keywords, such as: kelenteng indonesia, klenteng indonesia, bio indonesia, vihara indonesia and to study carefully in detail about the social changes of the Chinese community in Indonesia especially in relation with the identity as a Chinese, the practice of Chinese religion and the practice of Chinese New Year celebration.\nBig Chinese population cities and towns like Jakarta, Medan, Singkawang, Pangkal Pinang, Binjai, Bagansiapiapi, Tanjungbalai, Pematangsiantar, Selat Panjang, Tanjung Pinang, Batam, Ketapang and Pontianak always have its own New Year's celebration every years with parade and fireworks. A lot shopping malls decorated its building with lantern, Chinese words and lion or dragon with red and gold as main color. Lion dance is a common sight around Chinese houses, temples and its shophouses. Usually, the Buddhist, Confucian and Taoist Chinese will burn a big incense made by aloeswood with dragon-decorated at front of their house.The temple is open 24 hours at the first day, their also distributes a red envelopes and sometimes rice, fruits or sugar to the poor around.\nWith one of the largest Chinese populations outside of Asia, Sydney also claims to have the largest Chinese New Year Celebrations outside of Asia with over 600,000 people attending the celebrations in Chinatown annually. The events there span over three weeks including the launch celebration, outdoor markets, evening street food stalls, Chinese top opera performances, dragon boat races, a film festival and multiple parades that incorporate Chinese, Japanese, Korean people and Vietnamese performers. More than 100,000 people attend notably the main parade with over 3,500 performers.[108] The festival also attracts international media coverage, reaching millions of viewers in Asia.[109] The festival in Sydney is organized in partnership with a different Chinese province each year. Apart from Sydney, other state capital cities in Australia also celebrate Chinese New Year due to large number of Chinese residents.[110] The cities include: Brisbane, Adelaide, Melbourne Box Hill and Perth. The common activities are lion dance, dragon dance, New Year market, and food festival. In the Melbourne suburb of Footscray, Victoria a Lunar New Year celebration initially focusing on the Vietnamese New Year has expanded into a celebration of the Chinese New Year as well as the April New Year celebrations of the Thais, Cambodians, Laotians and other Asian Australian communities who celebrate the New Year in either January/February or April.[111]\nThe city of Wellington hosts a two-day weekend festival for Chinese New Year,[112] and a one-day festival is held in Dunedin, centred on the city's Chinese gardens.[113]\nMany cities in North America sponsor official parades for Chinese New Year. Among the cities with such parades are San Francisco,[114] Los Angeles,[115] New York City,[116] Boston,[117] Chicago,[118] Mexico City,[119] Toronto, and Vancouver.[120] However, even smaller cities that are historically connected to Chinese immigration, such as Butte, Montana,[121] have recently hosted parades.\nMultiple groups in New York City cooperate to sponsor a week-long Lunar New Year celebration. The festivities include cultural festival,[116] music concert,[122] fireworks on the Hudson River near the Chinese Consulate,[123] and special exhibits.[122] In June 2015, New York City Mayor Bill de Blasio declared that the Lunar New Year would be made a public school holiday.[124]\nThe San Francisco Chinese New Year Festival and Parade is the oldest and largest event of its kind outside of Asia, and the largest Asian cultural event in North America.\nThe festival incorporates Grant and Kearny Streets into its street festival and parade route, respectively.  The use of these streets traces its lineage back to early parades beginning the custom in San Francisco. In 1849, with the discovery of gold and the ensuing California Gold Rush, over 50,000 people had come to San Francisco to seek their fortune or just a better way of life. Among those were many Chinese, who had come to work in the gold mines and on the railroad. By the 1860s, the residents of San Francisco's Chinatown were eager to share their culture with their fellow San Francisco residents who may have been unfamiliar with (or hostile towards) it. The organizers chose to showcase their culture by using a favorite American tradition â€“ the parade. They invited a variety of other groups from the city to participate, and they marched down what today are Grant Avenue and Kearny Street carrying colorful flags, banners, lanterns, drums, and firecrackers to drive away evil spirits.\nIn San Francisco, over 100 units participate in the annual Chinese New Year Parade held since 1958.[125] The parade is attended by some 500,000 people along with another 3 million TV viewers.[126]\nIn London, the celebrations take place throughout Chinatown, Leicester Square and Trafalgar Square. Festivities include a parade, cultural feast, fireworks, concerts and performances.[127] The celebration attracts between 300,000 and 500,000 people yearly according to the organisers.[128]\nIn Paris, the celebrations are held since the 1980s in several districts during one month with many performances[129] and the main of the three parades with 40 groups and 4,000 performers is attended alone by more than 200,000 people in the 13th arrondissement.[130][131]\nMany celebrate the festival in Chinatown, Kolkata, India where a significant community of people of Chinese origin exists. In Kolkata, Chinese New Year is celebrated with lion and dragon dance.\nIn Pakistan, the Chinese New Year is also celebrated among the sizable Chinese expatriate community that lives in the country. During the festival, the Chinese embassy in Islamabad arranges various cultural events in which Pakistani arts and cultural organizations and members of the civil society also participate.[132][133][134][135]\nThe Chinese New Year is often accompanied by loud, enthusiastic greetings, often referred to as 吉祥話 (jíxiánghuà) in Mandarin or 吉利說話 (Kat Lei Seut Wa) in Cantonese, loosely translated as auspicious words or phrases. New Year couplets printed in gold letters on bright red paper, referred to as chunlian (春聯) or fai chun (揮春), is another way of expressing auspicious new year wishes. They probably predate the Ming dynasty (1368–1644), but did not become widespread until then.[136] Today, they are ubiquitous with Chinese New Year.\nSome of the most common greetings include:\nNumerous other greetings exist, some of which may be exclaimed out loud to no one in particular in specific situations. For example, as breaking objects during the new year is considered inauspicious, one may then say 歲歲平安 (Suìsuì-píng'ān) immediately, which means \"everlasting peace year after year\". Suì (歲), meaning \"age\" is homophonous with 碎 (suì) (meaning \"shatter\"), in the demonstration of the Chinese love for wordplay in auspicious phrases. Similarly, 年年有餘 (niánnián yǒu yú), a wish for surpluses and bountiful harvests every year, plays on the word yú that can also refer to 魚 (yú meaning fish), making it a catch phrase for fish-based Chinese new year dishes and for paintings or graphics of fish that are hung on walls or presented as gifts.\nThe most common auspicious greetings and sayings consist of four characters, such as the following:\nThese greetings or phrases may also be used just before children receive their red packets, when gifts are exchanged, when visiting temples, or even when tossing the shredded ingredients of yusheng particularly popular in Malaysia and Singapore. Children and their parents can also pray in the temple, in hopes of getting good blessings for the new year to come.\nChildren and teenagers sometimes jokingly use the phrase 恭喜發財,紅包拿來 (in Traditional Chinese; Simplified Chinese: 恭喜发财，红包拿来; Pinyin: gōngxǐfācái, hóngbāo nálái; Cantonese: 恭喜發財,利是逗來; Jyutping: gung1 hei2 faat3 coi4, lei6 si6 dau6 loi4), roughly translated as \"Congratulations and be prosperous, now give me a red envelope!\". In Hakka the saying is more commonly said as 'Gung hee fatt choi, hung bao diu loi' which would be written as 恭喜發財,紅包逗來 – a mixture of the Cantonese and Mandarin variants of the saying.\nBack in the 1960s, children in Hong Kong used to say 恭喜發財,利是逗來,斗零唔愛 (Cantonese, Gung Hei Fat Choy, Lai Si Tau Loi, Tau Ling M Ngoi), which was recorded in the pop song Kowloon Hong Kong by Reynettes in 1966. Later in the 1970s, children in Hong Kong used the saying: 恭喜發財,利是逗來,伍毫嫌少,壹蚊唔愛 (Cantonese), roughly translated as, \"Congratulations and be prosperous, now give me a red envelope, fifty cents is too little, don't want a dollar either.\" It basically meant that they disliked small change – coins which were called \"hard substance\" (Cantonese: 硬嘢).  Instead, they wanted \"soft substance\" (Cantonese: 軟嘢), which was either a ten dollar or a twenty dollar note.",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"chinese_new_year\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"chinese new year\",\n        \"otherNames\": [\"spring festival\", \"lunar new year\"],\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"nian\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"nian\",\n        \"description\": \"mythical beast associated with the Chinese New Year\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"lantern_festival\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"lantern festival\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"lunisolar_chinese_calendar\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"lunisolar chinese calendar\",\n        \"reference\": \"determines the date of the Chinese New Year\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"lunar_new_year_2018\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"lunar new year 2018\",\n        \"firstDay\": \"2018-02-16\",\n        \"zodiac\": \"dog\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"kichun\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"lichun\",\n        \"meaning\": \"start of spring\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"greater_china\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"greater china\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"overseas_chinese_communities\",\n      \"label\": \"concept\",\n      \"attributes\": {\n        \"name\": \"overseas chinese communities\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"hongjun_laozu\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"hongjun laozu\",\n        \"role\": \"taoist monk\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"nbc\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"nbc\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"chinese_new_year\",\n      \"target\": \"nian\",\n      \"type\": \"ASSOCIATED_WITH\",\n      \"attributes\": {\n        \"relationshipDescription\": \"nian is feared during Chinese New Year\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"chinese_new_year\",\n      \"target\": \"greater_china\",\n      \"type\": \"CELEBRATED_IN\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"chinese_new_year\",\n      \"target\": \"overseas_chinese_communities\",\n      \"type\": \"CELEBRATED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"chinese_new_year\",\n      \"target\": \"lunisolar_chinese_calendar\",\n      \"type\": \"DETERMINED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"lunar_new_year_2018\",\n      \"target\": \"kichun\",\n      \"type\": \"CLOSE_TO\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"nian\",\n      \"target\": \"hongjun_laozu\",\n      \"type\": \"CAPTURED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc70",
        "text": "Isle of Dogs (犬ヶ島, Inugashima) is a 2018 stop-motion animated comedy film written, produced and directed by Wes Anderson. Set in a dystopian near-future Japan, the film follows a young boy who goes in search of his dog after the whole species is banished to an island due to an illness outbreak. The film's ensemble voice cast includes Bryan Cranston, Edward Norton, Bill Murray, Jeff Goldblum, Greta Gerwig, Frances McDormand, Courtney B. Vance, Fisher Stevens, Harvey Keitel, Liev Schreiber, Bob Balaban, Scarlett Johansson, Tilda Swinton, F. Murray Abraham, Frank Wood, Kunichi Nomura and Yoko Ono.\nA US-German co-production, Isle of Dogs was produced by Indian Paintbrush and Anderson's own production company, American Empirical Pictures. The film opened the 68th Berlin International Film Festival, where Anderson was awarded the Silver Bear for Best Director. It began a limited release in the United States on March 23, 2018, by Fox Searchlight Pictures, with a wide release on for April 13, 2018. The film has grossed $41 million worldwide and received praise for its animation, story and deadpan humor; some critics, however, accused it of cultural appropriation.\nIn a dystopian near-future Japan, a dog flu virus spreads throughout the canine population. The authoritarian new mayor of Megasaki City, Kobayashi, signs a decree banishing all dogs to Trash Island, despite a scientist named Professor Watanabe insisting he is close to finding a cure. The first dog to be banished is Spots, who belonged to Atari Kobayashi, the orphaned nephew and ward of the mayor.\nSix months later, Atari runs away from home, steals a plane and flies to Trash Island to find Spots. After a crash-landing, he is rescued by five dogs: Rex, King, Duke, Boss, and Chief. They decide to help Atari locate Spots, although Chief, a former stray, is reluctant to fraternize with humans. Initially believing he died months ago after his cage failed to open upon arrival, the dogs soon learn there was a mixup and Spots may be alive elsewhere on the island. After a skirmish with a rescue team sent by Kobayashi to retrieve Atari, and at the insistence of a female purebreed named Nutmeg, Chief has a change of heart and decides to accompany Atari and company on their search. They seek advice from two sage dogs Jupiter and Oracle, who inform them of a rumored cannibal tribe of dogs on an isolated part of the island.\nMeanwhile, Professor Watanabe finds a cure, but is poisoned by Mayor Kobayashi to prevent the dogs from being returned from Trash Island. Foreign exchange student Tracy Walker suspects a conspiracy and begins to investigate. Ultimately, she confronts assistant scientist Yoko Ono, a former cohort of Watanabe, who confirms Tracy's suspicions and gives her the last remaining dose of the cure.\nDuring the journey, Atari and Chief are separated from the others. Atari bathes Chief, which reveals that his coat is actually white with dark spots, having become dirtied due to his time as a stray. Noticing the similarity between Chief and Spots' appearances, Atari realises that Chief is of Spots' breed, which is extremely rare. Chief recalls being part of a litter, where most of his siblings died, save for one. This implies that Chief may be Spots' brother. Chief reveals he was once a house pet, forced to flee after regretfully attacking his master out of fear. Chief begins to bond with Atari as they continue their journey alone together, with Chief beginning to open and care for Atari. They rejoin the group and locate the isolated, so-called 'cannibal', tribe of dogs, but find themselves ambushed by Kobayashi's men once again. Spots arrives with a small army of dogs who help fend off the assailants. Through flashbacks, he reveals that he was rescued upon arrival by the 'cannibal' tribe and later became their leader. Spots also confirms that Chief is his brother and asks to transfer his protection duties for Atari to Chief, and both agree.\nAn owl arrives, revealing that Kobayashi plans to order total extermination of all dogs on Trash Island upon his imminent re-election. Atari and many of the island dog tribe decide to return to Megasaki City to attempt to prevent this. At Kobayashi's election ceremony, he prepares to give the order, but Tracy presents her evidence of his corruption and the cure's existence. Atari and the dogs also arrive and confirm the cure works. Kobayashi has a change of heart, but his right-hand man Major Domo insists upon seeing the extermination through. A fight ensues in which the 'execute' button is pressed, but, instead, the poison backfires on the captors, thanks to a hacker friend of Tracy's, allowing the island dogs to escape death.\nDuring the fight, Atari and Spots are gravely injured. Atari's only remaining kidney fails, but Kobayashi, admitting his mistakes, donates his own to save the boy. By election law, mayorship of the city falls to Atari and he decrees that dogs be allowed to reintegrate into society. Tracy and Atari become a couple, and Chief reunites with Nutmeg and takes up the role of bodyguard for Atari.\nPresumed dead, Spots recovers from his injuries and secretly raises his children under the Kobayashi Manor.\nIn October 2015, Anderson, who had previously directed the animated film Fantastic Mr. Fox, announced he would be returning to the genre with \"a film about dogs\"[8] starring Edward Norton, Bryan Cranston and Bob Balaban.[9][10] Anderson has said that he was inspired by seeing a road sign for the Isle of Dogs in England while Fantastic Mr. Fox was in development.[11] Anderson said that the film was strongly influenced by the films of Akira Kurosawa, as well as the stop-motion animated holiday specials made by Rankin/Bass Productions.[12]\nProduction began in October 2016 at the 3 Mills Studios in East London.[13][14][15]\nOn December 23, 2016, Fox Searchlight Pictures acquired worldwide distribution rights to the film, with plans for a 2018 release.[16][17] A trailer was released on September 21, 2017.[18]\nThe film premiered as the opening film of the 68th Berlin International Film Festival on February 11, 2018, and had its North American premiere as the closing film of the SXSW Film Festival in Austin, Texas, on March 17, 2018.[19] Isle of Dogs began a limited release in the U.S. on March 23, 2018.[20] It was released nationwide in the United States on April 13, 2018.[21][22][23]\nAs of AprilÂ 25, 2018[update], Isle of Dogs has grossed $25.4 million in the United States and Canada, and $16.1 million in other territories, for a worldwide total of $41.5 million.[5]\nIn its first weekend of limited release, the film made $1.57 million from 27 theaters (an average of $58,148 per venue), which is the highest screen average of 2018 thus far.[21] 60% of its audience was under the age of 30.[24] In its second weekend the film made $2.8 million from 165 theaters (an increase of 74%), finishing 11th.[25] The film entered the top 10 in its third weekend, making $4.6 million from 554 theaters.[26] The film expanded to 1,939 theaters the following week and made $5 million, finishing 7th at the box office.[27]\nOn Rotten Tomatoes, the film holds an approval rating of 90% based on 241 reviews, and an average rating of 8.1/10. The website's critical consensus reads, \"The beautifully stop-motion animated Isle of Dogs finds Wes Anderson at his detail-oriented best while telling one of the director's most winsomely charming stories.\"[28] Metacritic assigned a score of 82 out of 100, based on 54 critics, indicating \"universal acclaim.\"[29] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale,[24] while PostTrak reported filmgoers gave it an overall positive score of 88%.[30]\nRichard Roeper of the Chicago Sun-Times gave the film 3.5 out of 4 stars, praising it for taking risks, and saying: \"It’s smart and different and sometimes deliberately odd and really funny — rarely in a laugh-out-loud way, more in a smile-and-nod-I-get-the-joke kind of way.\"[31] Exclaim! gave the film 7 out of 10, saying it \"has all the hallmarks of another Wes Anderson classic.\"[32]\nSome critics have argued that the film is an example of racial stereotyping and cultural appropriation, and that one of its characters aligns with the trope of the \"white savior\".[33] The Japanese characters speak unsubtiltled Japanese, with their dialogue instead being translated by arithmetic an interpreter or a machine. Justin Chang of the Los Angeles Times wrote \"It's in the director's handling of the story's human factor that his sensitivity falters, and the weakness for racial stereotyping that has sometimes marred his work comes to the fore... Much of the Japanese dialogue has been pared down to simple statements that non-speakers can figure out based on context and facial expressions\". Angie Han, writing in Mashable, calls the American exchange student character Tracy a \"classic example of the 'white savior' archetypeâ€“the well-meaning white hero who arrives in a foreign land and saves its people from themselves\".[34]\nWhile this critique has created some furore on the film's release, Chang has said that his review had been taken out of context and turned into a \"battle cry\" on Twitter, adding, \"I wasn't offended; nor was I looking to be offended\".[35] Another Japanese-American perspective was provided by Emily Yoshida, writing in New York Magazine, that these concerns had been \"seen before in debates about Asian culture as reflected by Western culture — perspectives can vary wildly between Asian-Americans and immigrated Asians, and what feels like tribute to some feels like opportunism to others\".[36] Writing for BuzzFeed, Alison Willmore found \"no overt malicious intent to Isle of Dogs' cultural tourism, but it's marked by a hodgepodge of references that an American like Anderson might cough up if pressed to free associate about Japan – taiko drummers, anime, Hokusai, sumo, kabuki, haiku, cherry blossoms, and a mushroom cloud (!). [...] This all has more to do with the... insides of Anderson's brain than it does any actual place. It's Japan purely as an aesthetic – and another piece of art that treats the East not as a living, breathing half of the planet but as a mirror for the Western imagination\".[37] She continued, \"in the wake of Isle of Dogs' opening weekend, there were multiple headlines wondering whether the film was an act of appropriation or homage. But the question is rhetorical – the two aren't mutually exclusive, and the former is not automatically off the table just because the creator's intent was the latter\".[37]\nThe film's score was composed by Alexandre Desplat, who previously worked with Anderson on Fantastic Mr. Fox, Moonrise Kingdom, and The Grand Budapest Hotel. The soundtrack also features various original and selected songs from a variety of musicians, mainly from Japan. Some songs had origins in classic Japanese cinema such as the Akira Kurosawa films Drunken Angel and Seven Samurai. Altogether, the soundtrack is compiled of 22 tracks, 15 of which were composed by Desplat.[45]\nAll tracks written and performed by Alexandre Desplat, except where noted.",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"isle_of_dogs\",\n      \"label\": \"work\",\n      \"attributes\": {\n        \"name\": \"isle of dogs\",\n        \"type\": \"film\",\n        \"releaseYear\": \"2018\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"wes_anderson\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"wes anderson\",\n        \"role\": \"director\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"bryan_cranston\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"bryan cranston\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"edward_norton\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"edward norton\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"bill_murray\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"bill murray\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"jeff_goldblum\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"jeff goldblum\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"greta_gerwig\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"greta gerwig\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"frances_mcdormand\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"frances mcdormand\",\n        \"role\": \"voice_cast\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"alexandre_desplat\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"alexandre desplat\",\n        \"role\": \"composer\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"american_empirical_pictures\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"american empirical pictures\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"indian_paintbrush\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"indian paintbrush\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"fox_searchlight_pictures\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"fox searchlight pictures\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"berlin_international_film_festival_2018\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"68th berlin international film festival\",\n        \"year\": \"2018\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"sxsw_film_festival_2018\",\n      \"label\": \"event\",\n      \"attributes\": {\n        \"name\": \"sxsw film festival\",\n        \"year\": \"2018\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"id\": \"akira_kurosawa\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"akira kurosawa\",\n        \"documentId\": \"docX\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"wes_anderson\",\n      \"type\": \"DIRECTED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"bryan_cranston\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"edward_norton\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"bill_murray\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"jeff_goldblum\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"greta_gerwig\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"frances_mcdormand\",\n      \"type\": \"FEATURES_VOICE\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"alexandre_desplat\",\n      \"type\": \"SCORE_COMPOSED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"american_empirical_pictures\",\n      \"type\": \"PRODUCED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"indian_paintbrush\",\n      \"type\": \"PRODUCED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"fox_searchlight_pictures\",\n      \"type\": \"DISTRIBUTED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"berlin_international_film_festival_2018\",\n      \"type\": \"OPENED_AT\",\n      \"attributes\": {\n        \"award\": \"silver bear for best director\",\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"sxsw_film_festival_2018\",\n      \"type\": \"CLOSED_AT\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    },\n    {\n      \"source\": \"isle_of_dogs\",\n      \"target\": \"akira_kurosawa\",\n      \"type\": \"INFLUENCED_BY\",\n      \"attributes\": {\n        \"documentId\": \"docX\"\n      }\n    }\n  ]\n}\n```"
    },
    {
        "doc_id": "merged_doc83",
        "text": "The Vampire Diaries is an American fantasy-drama television series which was first broadcast on The CW from 2009[1] to 2017, airing 171 episodes over 8 seasons. Kevin Williamson and Julie Plec adapted the TV series from L.J.Â Smith's novel series of the same name. Some of the characters appeared in the spin-off series, The Originals.\nThe series is set in the fictional town of Mystic Falls, Virginia. The focal points of the show are a love triangle – involving Elena Gilbert and vampire brothers Stefan and Damon Salvatore – and the town's supernatural history, involving Elena's friends and relatives.\nThe following is a list of series regulars who appear in one or more of the series' eight seasons. The characters are listed in the order they were first credited in the series.\nElena Gilbert (based on Elena Gilbert from the novels) is the central character and the female lead of the series for the first six seasons. She is the biological daughter of John Gilbert and Isobel Flemming, and adopted daughter of Grayson and Miranda Gilbert. She has a younger adoptive brother named Jeremy Gilbert, who is later revealed to be her biological cousin. She has an adoptive aunt named Jenna Sommers who serves as her and Jeremy's legal guardian in the first two seasons of the series. She is the descendant and doppelgÃ¤nger of Katherine Pierce.\nIn season one, surviving a car accident which killed her parents, Elena reluctantly returns to school for her junior year and begins dating a mysterious new student named Stefan Salvatore. It is later revealed that he is a 162-year-old vampire. Stefan's brother, Damon, also begins falling for Elena. After Stefan and Elena sleep together, she finds a picture of a woman named Katherine Pierce who looks exactly like her. Stefan reveals that this woman caused the brothers to feud 145 years ago, and turned them into vampires. He says that she was adopted and is actually a descendant of Katherine, and that he saved her the night of her parents' deaths. At the end of season one, Elena meets her birth mother, Isobel, who is now a vampire, and discovers that her uncle John, who she grew up hating, is her natural father.\nIn season two, she learns that she is a Petrova doppelgÃ¤nger, exactly resembling Katherine Pierce, which means that she can be sacrificed to release Klaus' werewolf side. The sacrifice later takes place, but Elena is saved because John sacrificed himself for her after Bonnie magically enchants him. However, her Aunt Jenna is turned into a vampire and, as part of the sacrifice, is killed by Klaus, leaving Elena without a guardian. In the season two finale, while Damon is dying from a werewolf bite, she forgives him for forcing her to drink his blood and kisses him. Damon is cured by drinking Klaus' blood. However, in order to convince Klaus to give his blood to Damon, Stefan had to turn into his \"Ripper\" self and accompany Klaus.\nIn season three, Elena does everything in her power to make Stefan regain his humanity, which he switched off to satisfy, and tolerate, Klaus. She grows closer to Damon while working together to save Stefan and try to defeat Klaus, eventually sharing a kiss. She later admits to Stefan that she has feelings for Damon as well, but that she never stopped loving Stefan. It is eventually revealed that Elena met Damon the night of her parents' death, though he compelled her to forget. She eventually chooses Stefan in the season finale but before she can tell him, Elena drowns while having vampire blood in her system; she then awakens as a vampire in transition.\nIn season four, Elena must decide whether to die or to feed on human blood so she can fully transition into a vampire. After realizing Stefan's desperation to keep her alive, Elena completes her transition. She claims that choosing Stefan was the best choice she'd ever made. However, their relationship ends due to her heightened feelings for Damon. Damon later realizes there is a sire bond between them, complicating the truth behind their relationship. Damon makes Elena turn off her humanity to avoid her grief when Jeremy is killed searching for a cure for vampirism. Elena becomes ruthless without her emotions. When she turns on her emotions again, her sire bond to Damon has been broken, though she remains in love with him. During a confrontation with Katherine, Elena shoves the cure down Katherine's throat, forcing her to become human again.\nIn season five, Elena starts at Whitmore College after spending the summer with Damon. She is kidnapped and experimented on by Wes Maxfield, and learns that her father experimented on vampires. Later, when Katherine is about to die as a result of the past 500 years catching up with her, Katherine uses a spell to possess Elena. Elena's friends trap Katherine when they realize this. Stefan stabbed her with the Traveler dagger, but ghost Katherine reveals to Bonnie, shortly before trying to cross into the Other Side, that she had injected Dr. Maxfield's enhanced ripper-werewolf virus into Elena's body, infecting her. Elena's friends are eventually able to find an antidote. She loses trust in Damon, partly because he killed her friend Aaron, so they break up, but soon get back together. Once Markos and his Traveler army begin to take over Mystic Falls, Elena and company come up with a plan to neutralize the Travelers by killing them all at the same time, overpowering Bonnie – who is now the anchor to the Other Side – and creating a possible way out of the collapsing dimension. Elena and Damon cause an explosion at the Mystic Grill, killing themselves and most of the Travelers. She wakes up as a ghost and passes to the Other Side; Elena and many others are able to pass back to the land of the living afterwards, but the spell that allows this is broken before Damon passes back through, and Bonnie is stuck as the anchor, leaving those alive mourning the loss of Damon and Bonnie.\nIn season six, Elena begins medical school, unable to set foot in her hometown. She is unable to recover from Damon's death and lurks at the edges of Mystic Falls â€“ preying on people, drinking their blood, and compelling them to forget. As spirit magic no longer works in Mystic Falls, her victims who cross into the town remember the ordeal, putting her identity as a vampire at risk. Elena begs Alaric to compel her to forget that she ever loved Damon, and he eventually succeeds. She is told of her former feelings for Damon soon afterwards, but doesn't want to go back to being unhappy again, and starts dating classmate Liam. After Damon comes back to life, Elena eventually decides to have the compulsion undone, but Alaric crosses into Mystic Falls and becomes human again. Elena is then left to face Damon and see if her feelings will return. Bonnie returns from the prison world with the cure to immortality which Elena takes, hoping to have family with Damon. However, in the season finale, Kai links Bonnie's life to Elena's, putting her in a magical sleep until Bonnie's dies.\nIn season eight, Elena appears in the final episode, appearing to Bonnie when her heart stops. However, Bonnie is brought back to life and Elena's body is then taken over by Katherine and trapped in the boiler room to die with the Hellfire. Stefan sacrifices his life to save Elena. They are briefly reunited so he can say goodbye. Bonnie eventually breaks Kai's spell on Elena and reunites her with Damon and her friends. Elena goes to medical school and marries Damon while continuing to write in her diary, thanking Stefan for saving her life in the pilot. She and Damon live long and happy human lives together before they die. In the afterlife, Elena finds peace by reuniting with Jenna, John and her parents.\nKatherine Pierce, born Katerina Petrova (based on Katherine von Swartzschild from the novels), was part of a \"Traveler\" (or Gypsy) family, and was banished to England after bearing an illegitimate child. Upon meeting Klaus and Elijah, two of the original vampires, she learns that she is a Petrova doppelgänger – which means that she can be sacrificed to release Klaus' werewolf side. She tricked other vampires into turning her, thereby making her useless to Klaus, then spent 500 years running and hiding to escape his wrath. She arrives in Mystic Falls, where both Stefan and Damon Salvatore fall in love with her. She escapes the burning of vampires in the town, and gives the brothers her blood so that they both turn into vampires after being shot. Damon spends 145 years trying to free Katherine from a tomb, though she is not there when he opens it. In the last episode of season one, Katherine returns to Mystic Falls.\nDuring season two, she tells Damon that she has always been in love with Stefan and never truly cared for Damon. It is later discovered that her real reason for returning is to appease Klaus by giving him the new doppelgÃ¤nger, the moonstone, and a vampire, witch, and werewolf. Stefan and Damon lock her in the tomb when they realize her plan, and even when the spell trapping vampires in the tomb is broken, she is compelled by Elijah to stay in. Elijah temporarily dies and Katherine is freed, but chooses to help Stefan and Damon. When Klaus comes to Mystic Falls, he kidnaps her and tortures her in Alaric's apartment. He eventually releases her, but she keeps track of Klaus and Stefan's whereabouts. When she learns that a vampire hunter named Mikael is the key to killing Klaus, she finds and awakens him, but goes back into hiding when Mikael's plan fails.\nKatherine returns in season four, allowing Jeremy to be killed by Silas so she can steal the cure. It is revealed that during her time away from Mystic Falls, she had begun a relationship with Elijah Mikaelson, having real feelings for him. She decides to give him the cure to prove that her love is real, though he eventually leaves her to be with his family in New Orleans. During a physical confrontation with Elena, Katherine is forced by Elena to drink the cure, leaving her human for the first time in 500 years.\nDuring season five Katherine struggles with being human again. She learns that her long-lost daughter, Nadia, is a vampire in Mystic Falls. Silas drains Katherine of all of her blood, to get the cure, and Katherine returns to life. However, she rapidly descends into old age from the 500 years of her existence. She uses her Traveler heritage to transfer her consciousness into Elena's body as hers dies, eventually taking control of Elena's body and masquerading as Elena to win Stefan's affection. Stefan and Caroline learn her identity and Stefan stabs her with the Traveler's Knife, releasing Katherine's soul from Elena's body. However, Katherine had injected Elena's body with Dr. Wes Maxfield's experimental \"Ripper Serum\", to turn Elena into a vampire who feeds from other vampires along with werewolf venom. An unknown force denies Katherine access to the Other Side and she was left in a dark void.\nIt is later revealed that Katherine was sucked into Hell, where she became a feared presence over six years. Katherine made a bet with Kai Parker, that whoever won would replace Cade as the ruler of Hell. Katherine's manipulation resulted in Kai's imprisonment in a Spirit Rule[clarification needed] and her ascension as the queen of Hell. She then escaped Hell and proceeded to taunt Stefan and Caroline on their wedding day. She manipulates Kelly and Vicki Donovan into doing her bidding, resulting in Kelly nearly killing Caroline's twins and Vicki ringing the bell. While everyone is distracted, Katherine steals Elena's body and traps it in the boiler room to ensure Elena dies in the Hellfire. Katherine then impersonates Elena to torture the brothers. They attempt to kill her, but she continues returning from Hell. Stefan then stays with Katherine to ensure that they both finally die in the Hellfire, destroying Hell and giving Katherine what she wanted â€“ to spend the rest of her life with Stefan.\nStefan Salvatore (based on Stefan Salvatore from the novels) was born and raised in Mystic Falls to Giuseppe Salvatore and Lily Salvatore, who died when he was young. Stefan is the younger brother of Damon, and the two were best friends in life. However, this changed when the brothers fell in love with Katherine Pierce. Once Stefan discovered Katherine was a vampire, Stefan was both scared and repulsed by Katherine and vampirism in general. Katherine, however, compelled Stefan to not be afraid of her, to keep her secret, and to drink her vampire blood against his will.\nIn 1864, Stefan was turned into a vampire after being shot by his father, with Katherine's blood in his system, and accidentally killed his father. Damon, who turned into a vampire as well, promised Stefan an eternity of misery as he was angry that Stefan had forced him to turn and jealous that Katherine had also turned Stefan. A newborn vampire with uncontrollable bloodlust, Stefan became severely out of control (later known as the Ripper) and addicted to the blood, killing many people. However, Stefan was taught by a vampire named Alexia \"Lexi\" Branson, who later became Stefan's best friend or companion. After decades of absence from Mystic Falls, Stefan returned to visit his home and Zach. Stefan heard the Gilbert's car accident at Wickery Bridge and saved Elena, who he noticed looked exactly like Katherine.\nStefan and Elena begin a relationship and he reveals to her that he is a vampire. However, Damon returns to Mystic Falls and also falls in love with Elena. As the series progresses, Damon and Stefan rebuild their brotherly bonds. Stefan only drank animal blood in the beginning of the series, which left him weaker than other vampires. In season two, Stefan starts to take small amounts of Elena's blood each day to mitigate its effect on him and to increase his strength. When Katherine returns, it is discovered that she has always been in love with Stefan and not Damon; however, Stefan is in love with Elena and not interested in Katherine. Stefan starts to build a friendship with Caroline Forbes after she is turned into a vampire. After Klaus gives Stefan his blood to save Damon from a werewolf bite, Klaus turns Stefan into a Ripper again.\nAs an arrangement to save Damon, Stefan works for Klaus while trying to protect Elena by keeping Klaus away from Mystic Falls. Klaus later finds out Elena is alive and compels Stefan to kill her, making Stefan turn off his humanity when he resists. Stefan is later able to get his humanity back – seen when he saves Klaus' life to protect Damon – but pretends not to care about Elena. He later takes it upon himself to kill Klaus. He steals Klaus' family and tries using them as blackmail. When that fails Stefan threatens to turn Elena into a vampire if Klaus does not get his hybrids out of town; Klaus agrees at the last minute. Stefan and Elena get into a fight, but Elena chooses Stefan over Damon. Later, Elena and Matt are trapped underwater; Elena makes Stefan save Matt first and she drowns with vampire blood in her system.\nDuring season four, Stefan's relationship with Elena is tested. He becomes fixated on finding the cure to vampirism for her, which results in Damon telling him that he can only love Elena as a human. Eventually, Stefan and Elena break up as a result of her feelings for Damon, which were amplified after being turned into a vampire. Stefan then forms a casual relationship with Rebekah (with whom he had a brief affair in the 1920s). After Elena eventually turns her humanity off as a result of her sire bond to Damon and Jeremy's death, Stefan and Damon attempt to find a way to force her to turn it back on. Eventually they do, but Elena remains in love with Damon and decides to be with him. Stefan is revealed to be the doppelgÃ¤nger of Silas, who locks Stefan in a large metal safe and pushes it into the bottom of a lake.\nStefan is rescued by the witch Qetsiyah, who brainwashes him and he falls in love with Elena again. He later regains his memories and kills Silas. Suffering from PTSD, Stefan manages to recover with the help of Katherine. The two begin a sort of relationship before Katherine's body fails her. It is later revealed that Katherine took over Elena's body and attempts to seduce Stefan; he kills her after saying goodbye one last time. Julian (in Tyler's body) ripped out Stefan's heart, killing him and sending him to the disintegrating Other Side. He reunites with Lexie, who saves him from getting sucked into Hell. Stefan manages to return to the land of the living, though Damon and Bonnie apparently die in the process.\nBy season six, Stefan has left Mystic Falls to attempt to live a normal life with a new girlfriend. However, a visit from Caroline and Enzo results in Enzo killing his girlfriend. Stefan returns to Mystic Falls to kill Enzo, but stays after reuniting with Damon. He later helps Caroline get through her mother's cancer and develops romantic feelings for her.\nIn season seven, Stefan is reunited with his mother and decides to forgive her. It is revealed that Stefan had slept with Valerie, one of the Heretics, while he was human, resulting in her pregnancy. Valerie lost the baby after Julian beat her. Stefan kills Julian and later develops a relationship with Valerie that ends soon after the encounter with Rayna.\nBy season eight, Stefan had entered into a relationship (and later engagement) with Caroline while he searched for Damon. Stefan later gave himself up in servitude to Cade (alongside Damon) in order to save Caroline's twins. Stefan's humanity is shut off and he goes on a murderous rampage to deliver souls to Cade. He is later sent for Elena and kills Enzo, but Bonnie injects him with the cure, rendering him human. Stefan's guilt greatly impacts his relationship with Caroline and friendship with Bonnie. He later kills Cade to save Damon and Bonnie. He reunites with Caroline and works towards earning Bonnie's forgiveness. Stefan and Caroline use their 'wedding' to lure Katherine out, and are married when she fails to appear. After their marriage, Stefan and Damon search for Elena's body, taken by Katherine. Stefan and Bonnie then realize they can redirect the Hellfire at Katherine to destroy Hell, but someone must sacrifice themselves to ensure she's hit while in Hell. Stefan and Damon argue over who should do it, as Stefan wants to find redemption for his killings and to give Damon a chance at happiness. Damon compels the human Stefan to leave, but Stefan had been taking vervain. Stefan injected Damon with his blood, giving him the cure, then shoves a human Damon aside and sacrifices his life to kill Katherine and save Mystic Falls. Stefan reunites with Elena, getting to say goodbye, then goes to the afterlife. Years later, Stefan is reunited with Damon.\nDamon Salvatore (based on Damon Salvatore from the novels) is a vampire, turned by Katherine Pierce one hundred and forty-five years prior to the beginning of the main storyline. He is the son of late Giuseppe Salvatore and the older brother of Stefan Salvatore. He is portrayed as a charming, handsome and snide person who loves tricking humans, and takes pleasure in feeding on them and killing them during the early episodes of the first season.\nDuring the first season, Damon gradually becomes kinder to the other characters, showing brief moments of compassion such as erasing Jeremy's traumatic memory of vampires. Damon apologizes for turning Vicki Donovan into a vampire and admits it was wrong. Later, he admits to Elena he came to the town wanting to destroy it but actually found himself wanting to protect it. Damon and Elena begin to kiss passionately before getting interrupted â€“ it is later revealed that it wasn't Elena he kissed, but Katherine Pierce.\nIn season two, Katherine tells Damon that she loved Stefan and never loved him. Elena later says something similar, leaving Damon heartbroken. He snaps Jeremy's neck (though Jeremy is wearing a ring which reverses damage done by supernatural creatures), incurring Elena's wrath. Bonnie declares hatred for Damon when she learns his blood turned Caroline Forbes into a vampire. After saving Elena and Stefan, Damon confesses his love for Elena but then compels her to forget his selfish words. Damon joins Rose to find out why the Originals are after Elena; they have sex, and Damon comforts Rose when she suffers a fatal werewolf bite. Elena and Damon then begin to mend fences, and Elena cares for Damon when he is bitten by Tyler at the end of the season. Expecting he will die, Elena gives him a kiss, but Damon is later cured by the blood of Klaus, the original hybrid.\nIn the third season, Damon helps Elena bring Stefan back to Mystic Falls. He is at first reluctant to involve Elena in the rescue attempts, and employs her guardian, Alaric Saltzman, in order to conceal that Elena is alive. Stefan's change in attitude causes a rift between Elena and Stefan while Damon and Elena grow closer. Elena's refusal to admit this incenses Damon, who reverts to previous uncaring and reckless behavior. This continues until, in a heated moment, Elena admits to loving both brothers. Elena chooses Stefan and Damon seems to accept this decision and his death by Alaric, but rushes to the hospital when he realizes Elena has died.\nDamon starts season four at Elena's bedside after learning that she died with vampire blood in her system, and is transitioning. Damon tries to kill Rebekah with a White Oak Stake, but she overpowers him and escapes. Later, Damon uses Matt as bait to draw out the deputies and Pastor Young. After dispatching the deputies, Damon is about to kill Matt when stopped by a vampiric Elena. Damon makes Elena drink his blood when she seeks his help from a new vampire hunter, which leads to a fight with Stefan over what kind of vampire Elena will become.\nDamon tasks Stefan with learning more about Connor, a vampire hunter, while Damon accompanies Elena to college to teach her how to hunt and erase memories from her victims. Damon declares that he loves Elena whether she's human or vampire, and they eventually begin a relationship, though it is complicated by a sire bond between them (his blood was used to turn her). Damon uses the sire bond to make Elena turn off her humanity to avoid the guilt of Jeremy's death. Later, Damon and Stefan force her to turn it back on, at which point the sire bond has broken. However, Elena remains in love with Damon and they continue their relationship.\nIn season six, Damon and Bonnie are trapped in a 1994 Prison World, which Damon initially believes is his own personal hell, as they continually relive a painful day from his past. While working with Bonnie to find a way back to Mystic Falls, and to take down Kai, Damon becomes friends with Bonnie. Eventually, Bonnie sends Damon back, leaving herself trapped with Kai. Damon tried to win Elena back, though she lost all her memories of their relationship. Damon is devastated when Liz dies. He reunites with Bonnie when she escapes the prison world with the cure for vampirism. Damon gave the cure to Elena – which undoes Alaric's compulsion – intending to take the cure himself so they can be together as humans. However, Kai casts a spell which puts Elena into a magical sleep until the time of Bonnie's death.\nIn season seven, Damon travels with Bonnie and Alaric and learns to live without Elena. He refuses to forgive his mother for past mistakes on her deathbed. The guilt takes a toll on Damon, and after Julian is killed, he decides to let himself desiccate in a coffin next to Elena, waiting out the years until Bonnie dies. He's later awakened by Stefan in order to help him fight Rayna.\nBy season eight, Damon and Enzo have gone missing. It is revealed that the two were taken by the siren Sybil, who forces them to go on various killing sprees. Despite Sybil's numerous attempts, Damon's love for Elena wins out. He later is forced into servitude for Cade; compelled to kill either Elena or Stefan, Damon instead kills himself with a piece of wood from Elena's coffin. His life is saved by Bonnie, and Stefan manages to kill Cade. In the series finale, Damon desperately searches for Elena's body, stolen by Katherine. Damon attempts to sacrifice his life to save Mystic Falls (and Elena) and kill Katherine with the Hellfire. However, Stefan injects Damon with the cure and takes his place. Damon and Elena marry and live a long and happy human life. Damon is then reunited with his brother in the afterlife.\nJeremy Gilbert (loosely based on Margaret Gilbert from the novels) is Elena Gilbert's younger brother, later revealed to be her biological cousin.\nIn the beginning of the series, Jeremy was emotionally damaged by the death of his parents and begins to use drugs. He was in love with Vicki Donovan, another drug user, causing a rivalry with her boyfriend, Tyler Lockwood. Vicki later breaks up with Tyler and starts a relationship with Jeremy. However, Jeremy witnesses Stefan kill Vicki (after Damon turned her into a vampire). At Elena's request, Damon makes Jeremy forget this, and Jeremy becomes more stable and stops using drugs. Jeremy then starts a relationship with a vampire named Anna, but John Gilbert, Jeremyâ€™s uncle, kills Anna at the end of season one. Jeremy tries to become a vampire by overdosing while having Anna's blood in his system, but he fails. He was later given John's ring, which protects him from a death caused by anything supernatural. In season two, Jeremy falls in love with Bonnie Bennett and they start a relationship. Jeremy later loses both his aunt and uncle on the day of the sacrifice, leaving Elena and himself without a guardian. In the season two finale, Jeremy was accidentally shot to death by Sheriff Forbes, but Bonnie was able to bring him back.\nHowever, bringing Jeremy back from the dead allowed him to see and communicate with the ghosts of his former girlfriends, Anna and Vicki, whenever he thinks about them. When the doorway to the Other Side was opened, Jeremy was able to physically interact with Anna. Bonnie finds out, resulting in their break-up. When Bonnie closes the doorway to the Other Side, Jeremy and Anna decide to let each other go. After Jeremy kills a hybrid and was almost killed by Klaus, Elena asks Damon to compel Jeremy into leaving Mystic Falls in order to live a normal life. However, after Klaus and the other Originals find out where Jeremy was, Elena takes Jeremy back home.\nIn season four, a vampire hunter, Connor, arrives in town, and only Jeremy can see his mysterious tattoos, later revealed to be a map to the cure for vampirism. When Connor is killed, Jeremy becomes part of The Five, a group of vampire hunters, and his 'hunter's mark' grows when he kills vampires. His urge to kill grows as well, and he attempts to murder Elena. Eventually, he finds a way to control this, and Damon trains him. After killing Kol, resulting in the death of his entire bloodline, Jeremy's mark completes, revealing a map to the cure. However, once he and Bonnie reach Silas, Katherine reveals herself and allows Silas to feed on Jeremy in order to awaken. She steals the cure, and Jeremy is killed when Silas snaps his neck. Elena then burns the Gilbert house, creating a cover story for his death. When Bonnie drops the veil to the Other Side, Jeremy's ghost returns, saving Elena from Kol. Bonnie performs a spell that allows Jeremy to stay alive. The spell, however, killed Bonnie in the process, though Jeremy can see her ghost.\nIn season five, Jeremy attempts to keep Bonnie's death a secret for her in order to preserve her friends' happiness. However, Jeremy eventually reveals the truth to his friends. Bonnie and Jeremy are reunited after she becomes the new anchor to the Other Side, though she sacrifices her life once more in the finale to save Elena, Stefan, Enzo, Tyler and Alaric. It was revealed that Jeremy's supernatural hunter status was inactive as a result of the anti-magic barrier around the town.\nIn season six, Jeremy has become a drunk after Bonnie's death, paying her cell phone bill just to hear her voicemail recording. After Kai absorbed the Travelers' spell around Mystic Falls, Jeremy regained his hunter abilities. Later, Jeremy came to the conclusion that it was time for him to move on with his life and leave for Santa Fe, New Mexico. While nearly all of his friends and family are under the impression that Jeremy is going to art school there, in reality, Jeremy has moved there to hunt vampires, with only Alaric, who planned to feed him leads, knowing Jeremy's true plans. Jeremy returns in the series finale, shown teaching gifted youngsters how to defend themselves against the supernatural at the Salvatore School.\nJenna Sommers (loosely based on Judith Maxwell from the novels) was Elena and Jeremy Gilbert's aunt. She was the sister of their mother, Miranda Sommers-Gilbert. After her sister and her sister's husband were killed in a car crash, she took over as Elena's and Jeremy's legal guardian and moved into the Gilbert family home. In the beginning, Jenna had trouble coping as an authority figure, having been a partying college student, but as the series progresses she becomes better at it. She begins dating news reporter Logan Fell, who had cheated on her in the past. However, Logan was turned into a vampire by Anna and then killed by history teacher Alaric Saltzman; Jenna was told that he had left town. She later begins a relationship with Alaric.\nIn season two, John Gilbert begins to cause trouble between Jenna and Alaric, and Jenna suspects that Alaric is not completely honest with her. When Isobel Flemming, Alaric's supposed dead wife, shows up at Jenna's door, Jenna becomes angry with Elena and Alaric â€“ who then tell her everything about vampires. Jenna was later turned into a vampire by Klaus, to be used in the sacrifice to release his werewolf side. She attempts to kill Greta Martin, Klaus' witch, to stop the sacrifice and saves Elena, at which point Klaus stakes her to death.\nIn season three, Jenna is seen in the season finale, in flashbacks of the night Elena's parents' car went off Wickery Bridge. She is later seen as one of Katherine's hallucinations in season five. Jenna then appears in the series finale, where she and her family reunite with Elena as she passes.\nBonnie Sheila Bennett (based on Bonnie McCullough from the novels) is Elena's best friend. From season seven, she becomes one of two female leads. She is good friends with Caroline Forbes. In the beginning of the series, Bonnie discovers that she is a witch born from a line of witches. Her grandmother, Sheila Bennett, helps her learn to use her powers. When her grandmother dies, Bonnie continues training and becomes more and more powerful. In the midst of season two, she starts a relationship with Jeremy Gilbert, Elena's younger brother. She later discovers, from warlock Luca Martin, that the only way to kill Klaus, the original vampire who wants to kill Elena, is for her to get the power of one-hundred dead witches. Once she does this, she pretends to be dead in a scheme of Damon's to trick Klaus. But when she brings Klaus to the brink of death, Elijah does not kill him, as planned, and carries Klaus away before Bonnie could react.\nIn the season two finale, Bonnie is able to save Jeremy from dying after she tells her dead ancestor Emily Bennett that she loves him. However, bringing Jeremy back from the dead allows him to see his dead ex-girlfriends. Bonnie later finds out that Jeremy kissed Anna when the doorway to the Other Side was temporarily opened, and she breaks up with him. Later on, Bonnie reconnects with her mother, Abby, who had abandoned her as a child, and who helps her to kill the original vampires. However, Abby is turned into a vampire by Damon and abandons Bonnie again. In the season three finale, Bonnie places Klaus' soul into Tyler's body, thus preventing him from being completely destroyed by Alaric and saving Tyler, Caroline, Damon, and Stefan from dying (as part of Klaus' bloodline). In the beginning of season four, Bonnie learns that there is a forbidden magic, but she is forced to use it to transfer Klaus back to his original body, as a result, angry spirits attack her grandmother's ghost.\nProfessor Atticus Shane mentors Bonnie in regaining her powers. However, unknown to her, this 'Art of Expression' draws magic from the spirits of a massacre. It is revealed that Bonnie is a key component to finding the cure, as she was a descendant of the witch who entombed Silas, and is the only one who can open the tomb. During the course of the fourth season, she becomes closer to Jeremy again, hinting at a possible reunion between the two. However, upon finding the cure, Jeremy is killed by Silas. Feeling unimaginable grief, Silas, posing as Shane, manipulates Bonnie into believing that she can bring him back from the dead, but only if she brings back every supernatural creature who has died. When Bonnie drops the veil to the Other Side, she is overpowered by Silas. Bonnie manages to petrify Silas. Afterwards, Bonnie is determined to bring Jeremy back to life, despite Sheila's warning. The spell ends up killing Bonnie, who awakens as a spirit. She eventually brings the veil back up, leaving Jeremy (who she resurrected) as the only one who can see her.\nIn season five, Bonnie is resurrected â€“ but every supernatural who dies has to go through her to the afterlife, thus she feels the pain of their deaths. She and Damon are then trapped in another dimension together while the others think they are dead.\nIn season six, Bonnie and Damon develop a friendship and find out from a psychotic killer, Kai, that they can get home by using her magic. However, the plan backfires when Kai tries to kill Bonnie and she sacrifices herself for Damon, which sends him back home. Later, Kai also returns to the living world, leaving Bonnie all alone. Bonnie eventually manages to come home but has a more-violent disposition. She got revenge when she left Kai in a prison world but he returned, due to the Heretics. At the end of the season, she is linked to Elena through a spell Kai made that put Elena in a coma as long as Bonnie lives.\nIn season seven, Bonnie is more united with Damon and their relationship develops while she starts having feelings for Enzo. Her friendship with Damon ends because he left Bonnie while he desiccated himself in a coffin until Elena wakes, so Bonnie would never see him again. Three years later, she had romantic a relationship with Enzo. She discovers that the armory is looking for her so she hides with Enzo. They make a deal with Rayna, but she did not tell them that she was going to be the next huntress. When Bonnie woke up she tried to kill Damon, Enzo, and Caroline because Rayna marked them. She almost killed Enzo but Damon burned the last shaman in the armory so Bonnie was not the huntress anymore and saved Enzo. Finally, she forgave Damon.\nBy season eight, Enzo and Damon disappeared and Bonnie could not locate them, leaving her without two of the people she most cared about. Bonnie manages to rescue Damon and Enzo from Sybil's control using objects from the Armory, and resumes her relationship with Enzo. They plan for him to take the cure and live as humans together, but Stefan kills Enzo after his humanity shuts off. Bonnie injects him with the cure and her grief from Enzo's death causes her to unlock her psychic abilities. She manages to forgive Stefan and uses her power to see Enzo, but she breaks off the connection in order to channel her power into saving Caroline's twins. Inspired by her ancestors and Enzo, Bonnie gains new empowerment, saving Mystic Falls with the Hellfire. Her newfound strength allows her to break the spell over Elena and reunite with her best friend. Bonnie then fulfills her promise to Enzo to live her life, and leaves to travel the world as he watches over her.\nCaroline Forbes (based on Caroline Forbes from the novels) is Elena Gilbert and Bonnie Bennett's best friend. From season seven she becomes one of two female leads. Caroline is the daughter of the Sheriff of Mystic Falls, Liz Forbes, with whom she had a troubled relationship that develops into a more-loving relationship. Her father, Bill Forbes, left her and her mother after coming out as gay. In the beginning of the series, Caroline is shown as shallow, self-absorbed and envious of Elena. However, Caroline's character deepens and matures over the seasons. In season one, she was first attracted to Stefan but when he turns her down she pursues Damon. Damon used her in many ways, compelling her to forget much of it. During season one, she starts a relationship with Matt Donovan. At the end of season one, Caroline, Matt, and Tyler met an accident.\nIn season two, Caroline was fed Damon's blood to heal her injuries; however, Katherine kills her and Caroline feeds on a bag of human blood at the hospital, turning into a vampire. Stefan helps Caroline control her bloodlust and they build a friendship. Caroline also becomes closer to Elena. She discovers that she is not able to control her bloodlust when she is around Matt, and tricks him into breaking up with her in order to protect him. When Tyler Lockwood starts his werewolf transformations, Caroline helps him and he starts to develop romantic feelings for her. However, Caroline is in love with Matt and they get back together as soon as Tyler leaves town. Matt later finds out that Caroline is a vampire; feeling alienated and betrayed, he tells her mother. At first they don't accept her, but when they realize that Caroline has retained her humanity, they soften. However, Matt breaks up with her, due to his aversion of the supernatural since the vampire death of his sister, Vicki. When Tyler returns to Mystic Falls, he and Caroline become closer and in the season three premiere, they sleep together. However, Carol Lockwood finds out Caroline is a vampire and contacts her father, Bill Forbes. He thinks Caroline is a monster and tries to \"fix\" her through torture, but she is saved by her mother and Tyler. Bill and Caroline eventually make amends, and she is devastated when he is killed during season three. Klaus Mikaelson takes a liking to Caroline during this season and she refuses to be wooed by him, staying loyal to her friends despite her attraction to him.\nIn season four, Caroline helps Elena with her vampire transition. Her relationship with Tyler becomes strained with Klaus and the werewolf Hayley around. Caroline assumes something is going on between Hayley and Tyler, but Tyler denies it (which is the truth). During the plan to get the cure, Caroline and Tyler watch over Klaus, who is trapped in the Gilbert home by Bonnie. They learn there is only one dose for the cure. After a talk with Klaus, it is revealed that Caroline would never take the cure, preferring herself as a vampire. When the spell wears off, Klaus tells Tyler to run, because Klaus would kill him for tormenting and teasing him. Caroline doesn't want Tyler to go because she loves him but knows it is for the best. Caroline completes the Expression triangle by killing 12 witches in an attempt to save Bonnie, which opens up the gates to Other Side, letting all dead supernaturals loose in Mystic Falls. Caroline graduates high school with Bonnie, Matt, Stefan, and Elena, the ceremony interrupted by the 12 dead witches who make an attempt on Caroline's life. She is saved by Klaus, who she had invited to the graduation, and who says goodbye and that he intended to be her last love.\nIn season five, Caroline and Elena start college, both thinking Bonnie will come soon. Caroline assumes that Tyler will join them at Whitmore College. Outside a party, Caroline and Elena find their roommate Megan thrown from the second floor of a house with a bite mark on her neck, and realize there is another vampire at the college. Later, Caroline receives a message from Tyler that he can't return and they break-up when he refuses to give up his revenge upon Klaus. Klaus returns to Mystic Falls in an attempt to gloat over a dying Katherine, but is distracted by Caroline. She confesses her hidden desires for him, and they sleep together, Klaus vowing to never come back to Mystic Falls for her confession. Despite judgement from Tyler, Caroline refuses to feel guilty for her actions and builds a strange friendship with Enzo.\nIn season six, she realizes she has feelings for Stefan, despite his attempts to ignore her all summer. She looks for ways to break the Travelers' spell on Mystic Falls so that they can go home (this is later accomplished when Kai absorbs the magic). Caroline's mother, Liz, is diagnosed with cancer and Stefan attempts to comfort her. Caroline turns off her humanity as she can't deal with the pain of Liz dying. Stefan realizes that he has feelings for Caroline but is too late as her humanity is already off. Caroline asks for a year with no humanity where she promises to behave as long as they don't attempt to trigger her humanity before then. They do not leave her alone, angering Caroline and as revenge she kidnaps Stefan and Damon's niece, Sarah Salvatore, and blackmails Stefan to turn off his humanity. Stefan attempts to make Caroline lose control, and after numerous attempts he finally succeeds. Lily manages to trigger Stefan's humanity, and he becomes determined to get Caroline back to normal. He pretends to Caroline that his humanity is off and they get locked up together in a bed and breakfast in Grove Hill by Damon and Elena. Caroline eventually turns her humanity back on.\nIn season seven, Caroline and Stefan attempt to form a romantic relationship but his past with Valerie prevents this. She later discovers that the Gemini Coven had placed Alaric and Jo's twins inside her to protect them. She gives birth to two girls, Josie and Lizzie (named after Jo and her mother, Liz Forbes). Stefan decides to break-up with Caroline as he runs from the Hunter with Valerie. Caroline and Alaric move to Texas and become a family, where Caroline quickly steps into the motherly role.\nBy season eight, Caroline is co-parenting her children with Alaric and soon becomes engaged to Stefan. Their relationship again becomes complicated when Stefan is forced to serve Cade in order to protect Caroline's daughters. Caroline saves her kids and Alaric from the recently returned Kai and helps Alaric open a school for child witches. She and Stefan resume their engagement after he flips his switch back on, and the two stage a wedding in an attempt to draw out Katherine. Shortly after, Caroline is forced to say goodbye to Stefan when he sacrifices his life to save Elena and Damon. Caroline chooses to leave town with her daughters, though she and Stefan do get a bittersweet goodbye. Caroline and Alaric open a school for gifted supernatural children after receiving a large donation from Klaus, who praises her actions. It is implied from Alaric's voiceover that the donation is the \"beginning of another story.\"\nMatthew G. \"Matt\" Donovan (based on Matthew Honeycutt from the novels) is Elena Gilbert's childhood friend and ex-boyfriend. Vicki Donovan is Matt's older sister, who he takes care of as their troubled mother has left them. When Vicki dies, Matt is devastated. He is best friends with Tyler Lockwood. He is employed at the Mystic Grill as a busboy. Elena had broken up with Matt at beginning of the series, though Matt has feelings for her and wants to get back together, since Elena and Matt were each other's \"first\". However, he later starts a relationship with Caroline Forbes.\nWhen Caroline is turned into a vampire in season two, she tricks Matt into breaking up with her, for she can't control her bloodlust around him. However, they later get back together. When Matt learns that Caroline is a vampire, he suspects she had something to do with Vicki's death. He asks her to make him forget, but he secretly has vervain in his system and only pretends to forget; this was a plan of Sheriff Forbes. However, Matt finds out that Caroline is still the same person and tells her about the plan. He then breaks up with her due to the fact that he has too much to handle with work and school and doesn't want to deal with the fact that Caroline is a vampire.\nIn season three, Matt learns that Jeremy is able to see Vicki's ghost; after he drowns himself and is saved by Bonnie, he is able to see and speak to Vicki as well. She tells him that with his help, the original witch can make her come back whenever she wants without needing Matt to think about her. After he helps her, Matt finds out that the original witch wants Vicki to kill Elena in return; with the help of Bonnie, Matt makes Vicki return to the Other Side and shuts her out of his thoughts.\nIn season four, Matt blames himself for Elena's vampire transformation â€“ Damon also blames him and wants Matt dead. Matt holds a grudge against Rebekah for trying to kill him and causing Elena's transition. Matt later moves into the Gilbert house when Elena moves out, due to Jeremy's urge to kill her. However, Elena moves back in, only for Jeremy to be killed soon after. Matt is shown to be devastated by the loss of his friend. He later develops a relationship with Rebekah Mikaelson and leaves Mystic Falls after graduation to travel with her.\nThey part on good terms as she goes to New Orleans in season five. Another woman the two had encountered (and slept with) in Europe, Nadia, later appeared in Mystic Falls where she followed Matt. It is revealed that she is Nadia Petrova, and is searching for her mother, Katherine. Matt was possessed by a Traveler for a brief time and was involved with Nadia. Nadia later compelled him to forget that Elena was possessed by Katherine. After Nadia's death, Matt helps his friends deal with the destruction of the Other Side with the help of Liv and Luke Parker.\nIn season six, Matt helps Jeremy cope with the apparent death of Bonnie and the two attempt to kill Enzo. After Elena falls into a magical, coma-like slumber, Matt takes on more responsibility and eventually becomes the sheriff of Mystic Falls. During this time, Matt ejects all vampires from Mystic Falls.\nIn season seven, Matt falls in love with his partner, Penny Ares. A vampire makes Matt kill Penny, and he becomes hellbent on getting revenge on Stefan. However, after a series of events forces Matt to try and save Bonnie from being a bloodthirsty supernatural Huntress, Matt is exhausted of the war between humans and vampires; he decides to leave Mystic Falls and start a normal life.\nIn season eight, Matt is reunited with his long-lost father, Peter Maxwell, who had abandoned him and Vicki when they were children. Peter reveals that Matt's ancestors were the founders of Mystic Falls before the 'founding' families took it over. They had built a bell in the Clock Tower, that upon being hit twelve times by a Maxwell descendant, would unleash the Hellfire and kill everyone around it. Stefan compels Matt to ring the bell, but Damon manages to stop him on the eleventh ring. This inadvertently allows several individuals to escape Hell, including Matt's own mother and sister (and also Cade, Katherine and Kai). His mother and sister later go to work for Katherine in order to stay out of Hell: Kelly injures Peter before dying again and Vicki plans on ringing the bell. Matt tells Peter about Vicki; they all go up the clock tower and Matt watches Peter and Vicki reuniting and hugging. Matt and Peter later watch the tower erupt in flames after the twelfth ring of the bell. After Hell is destroyed, Matt continues to be sheriff and is about to run for mayor, where he's watched over by his sister and Tyler.\nVicki Donovan (loosely based on Vickie Donovan from the novels) was Matt Donovan's older sister. Vicki was a troubled drug-addict, taken care of by Matt as their mother had left them. In the beginning of the series, she was dating Tyler Lockwood. Vicki and Jeremy hooked-up a few times but Vicki didn't want people to find out, since Jeremy was younger than her. Later, acknowledging that she had feelings for Jeremy, Vicki breaks-up with Tyler and starts a relationship with Jeremy. She was later turned into a vampire by Damon. She was unable to control her bloodlust and when she attacked Jeremy, Stefan kills her. Stefan and Damon make it seem as if Vicki had left town. Her body is later found by Caroline Forbes, devastating Matt and Jeremy. Later, when Jeremy is brought back to life, he was able to see and communicate with Vicki, who asks for his help. Matt learns of this and engineers a near-death experience so he can also see Vicki. She tells him that with his help, the original witch can make sure she can come back whenever she wants. However, Matt later finds out that the original witch ordered Vicki to kill Elena in return; with the help of Bonnie, Matt makes Vicki return to the Other Side and shuts her out of his thoughts.\nVicki later returns in season five, to ask Jeremy and Bonnie to tell Matt to stop sleeping with Rebekah. She reappears on the Other Side when Liz Forbes kills Matt, and is later pulled away from the Other Side in a similar way to Katherine.\nVicki returns in season eight and appears in Damon's mind, when he has flashbacks of his attack upon her in the pilot episode. It is later revealed that Vicki managed to escape Hell alongside Katherine and her mother. Vicki went on a killing spree before going to the Mystic Falls Clock Tower to ring the bell and bring the hellfire to destroy Mystic Falls. Vicki is then reunited with her brother and father and completely breaks down. She had wanted to get out of the torturous Hell by ringing the bell for Katherine, but her family inspires her to become the person she always wanted to be. She goes through with their plan to save Mystic Falls and kill Katherine. Vicki then finds peace in the afterlife with Tyler, where they continue to watch over Matt.\nTyler Lockwood (based on Tyler Smallwood from the novels) is the son of Mayor Richard Lockwood and Carol Lockwood. He plays for the Mystic Falls High School football team and is best friends with Matt Donovan. Tyler does not have a good relationship with his father, who sometimes acts violently towards him. However, when his father dies, Tyler is shown to be genuinely upset. In the beginning of the series Tyler is an arrogant bully. He is dating Vicki Donovan, who breaks-up with him for Jeremy Gilbert, causing them to become rivals. Tyler is shown to have a short temper and in season two Tyler learns from his uncle, Mason Lockwood, that he acts this way due to the werewolf gene.\nAfter Tyler accidentally kills Sarah, a classmate who was compelled by Katherine to provoke him, his fears come true as he has triggered the werewolf curse. Caroline Forbes, a young vampire, helps him prepare for his new life, and Tyler eventually falls in love with Caroline. A werewolf named Jules comes to town and tells Tyler that Caroline, Stefan and Damon are responsible for his uncle's death, making Tyler feel betrayed. After Caroline is captured by a group of werewolves and Tyler hesitates to come to her rescue, Caroline breaks off their friendship. Hurt by Caroline's decision and wishing to protect his friends, Tyler later leaves town with Jules. However, he returns when his mother is in the hospital and makes amends with Caroline, deciding to stay in Mystic Falls.\nTyler and Caroline's friendship deepens and in the season three premiere, they end up sleeping together. After his mother learns that Caroline is a vampire and kidnaps her as she is trying to sneak out, Tyler reveals that he is a werewolf by transforming in front of her. After he helps Sheriff Forbes rescue Caroline from her father, they begin an official relationship. Tyler is later turned into a hybrid by Klaus. Due to his transformation to a hybrid, he is sired to Klaus, and would do anything to protect Klaus as his master. When Tyler tells Caroline that he is okay with this, she breaks up with him. Tyler eventually realizes that the sire bond isn't in his favor, and breaks it by repeatedly turning into a werewolf. He and Caroline get back together, but in the season three finale, Bonnie places Klaus' spirit in Tyler's body in order to save his bloodline (which includes Katherine, Stefan, Abby, Damon, Caroline and Tyler himself). It is unknown what happened to Tyler's spirit during this time, or if he agreed to the plan. Klaus later forces Bonnie to return him to his original body; once the transfer is complete, Tyler regains control of his body.\nTyler, along with a new friend, Hayley, begin to secretly unsire all of Klaus' hybrids. However, on learning about this, Klaus murders them all, along with Tyler's mother. As a result, Tyler is eventually forced to leave town, knowing that Klaus will seek revenge upon him. He returns briefly for prom. Klaus later grants Caroline a graduation present, allowing Tyler to return to Mystic Falls.\nLater, Tyler became possessed by Julian, a Traveler. After the Travelers used the Body Sealing Spell on Tyler, Julian gained permanent control of Tyler's body and due to Markos destroying the Traveler's Knife that was needed to remove Passengers, Julian could not be banished. Later, Julian was captured by the Travelers and they brought Julian to Mystic Falls, where they had cast a spell that can undo magic, including vampirism. Thus, when Julian entered Mystic Falls, he lost Tyler's vampirism and they both died, because vampirism was what kept them alive. Tyler ended up on the Other Side, but thanks to Bonnie and Damon's sacrifices, he was able to come back to life and he discovered that he was no longer a hybrid.\nIn season six, Tyler struggles to stay human, and develops a relationship with the witch Liv Parker. At the end of the season, Liv's brother Kai attacks and critically injures them both, and Liv convinces Tyler to kill her in order to trigger his curse and thereby heal. Tyler reluctantly agrees, knowing that she was going to die anyway. He manages to injure Kai and save Alaric's life. Tyler leaves Mystic Falls after saying goodbye to Elena.\nTyler returns in season seven in order to take Elena's coffin to protect her from the Heretics. He returns again in season eight and is killed by Damon. Tyler is seen in the series finale as having been reunited with Vicki, where the two find peace together and continue to watch over Matt.\nAlaric J. Saltzman, known as \"Ric\" (based on Alaric K. Saltzman from the novels), was the history teacher at Mystic Falls High School. Alaric originally comes to town to kill Damon, to avenge his wife. However, it was later revealed that his wife, Isobel Flemming, requested that Damon turn her into a vampire. Alaric then starts to become friends with Damon. Alaric owns a Gilbert Ring, which he obtained from Isobel, which prevents him from being killed by anything supernatural. However, John Gilbert later claims the ring. Alaric starts a relationship with Jenna Sommers. In the second season, Gilbert starts causing trouble between Jenna and Alaric, and Jenna leaves when she meets Isobel and knows Alaric has been keeping secrets from her. His body was later possessed by Klaus to gain the group's trust. Eventually Klaus releases Alaric, who gets back together with Jenna, but soon afterwards Klaus turns Jenna into a vampire and kills her for his sacrifice ritual, leaving Alaric heartbroken. In season three, Alaric moves in with Elena and Jeremy to take care of them, and represents the Gilbert family on the Founders' Council. He later starts dating council-member Meredith Fell, a local doctor.\nIt is later learned that Alaric was unknowingly killing people, due to the Gilbert ring giving him a vampire-hating alter ego, which was referred to as \"The Darkness\" or \"Evil-aric\". He was later turned into an Original vampire by Esther in order to kill Klaus with an indestructible White Oak stake. In the season three finale, he dies when Elena drowns because their lives had been linked by Esther. He appears to Jeremy as a ghost to say goodbye, stating that he will always be there for them, and later at his grave where he listens to Damon lament about his responsibilities.\nLate in season four, Alaric's ghost appears to Damon when Bonnie partially drops the veil to the Other Side. In the season five finale, Alaric came back to life by passing through Bonnie.\nAlaric is a regular in season six,[2] having trouble adjusting to life as a vampire. He gets a job at Whitmore College as the occult studies professor. After Elena is unable to recover from Damon's death, she begs Alaric to compel her to forget that she ever loved Damon â€“ which he can do as an enhanced Original. Alaric starts forming a relationship with Jo, a doctor at the college, but decides it would be best if they weren't together and attempts to compel her into thinking she didn't enjoy their time together; this fails to work as Jo is a witch. After Damon comes back to life, Alaric tries to convince Elena to allow him to undo the compulsion. Damon and Enzo are abducted by Tripp Cooke, who plans to kill them by driving them into Mystic Falls. Alaric and Stefan attempt to save them, but Alaric passes the border and begins to succumb to the injuries that caused his death until Jo arrives to keep him alive in a human state. This prevents him from reversing his compulsion on Elena. In season six, Alaric and Jo are married and expecting a baby. Jo is killed at their wedding and in season seven he attempts to resurrect her.\nIn season seven, it is revealed that the Gemini Coven placed Alaric and Jo's twins inside Caroline Forbes for protection. Caroline gives birth to the twins, named Josie and Lizzie (after Jo and Liz Forbes). They eventually move to Texas and become a family. Caroline and Alaric do not remain together as she begins a relationship with Stefan. In season eight, Alaric and Caroline co-parent their children, who've begun using magic. Alaric later turns the armory into a school for kids like his daughters, to teach them to control their powers. In the series finale, Alaric opens a school for gifted youngsters with Caroline in Stefan's name, where he and his daughters are watched over by Jo.\nLorenzo \"Enzo\" St. John is a vampire formerly under the imprisonment of the Augustine society, where he was Damon's cellmate in the 1950s. He and Damon later revive their friendship while he searches for his lost lover, Maggie. Enzo shuts off his humanity after Damon reveals that he was the one who killed Maggie and then killed himself by having Stefan rip his heart out. He was resurrected in the season finale.\nEnzo is a series regular in season six,[3] helping Caroline discover a way to resurrect Damon and Bonnie. After they visit Stefan and learn that he had been lying about searching for a solution, Enzo kills Stefan's human girlfriend, Ivy. In response to this, Stefan later finds Enzo, incapacitates him, and turns him over to Tripp Cooke, a vampire hunter with a familial link to Mystic Falls. It is later revealed that Enzo had made Ivy drink his blood, and she became a vampire. Enzo won't reveal the names of other vampires, so Tripp plans to drive him and Damon into Mystic Falls to kill them, reuniting the two friends (in chains once again), who are narrowly saved by Stefan and Alaric.\nIn season seven, out of love for Lily, Enzo allies himself with the Heretics. Eventually, he begins working for The Armory due to his interest in his past and later to learn his family's purposes. Enzo hides Bonnie from the Armory as they need her to open a mysterious vault. He gives her pills to mute her magic and the two fall in love. Enzo pursues Damon into a vault in the Armory when discolored and long-clawed hands grab his face and pull him backward.\nIn season eight, Enzo falls under the control of the siren Sybil, killing many humans across the country with Damon. His love for Bonnie, however, prevents him from falling completely under Sybil's control. Bonnie rescues him and the two resume their relationship, eventually planning for Enzo to take the cure and buy a house together in New York. Enzo is murdered by Stefan (on Cade's orders), which causes Bonnie to unleash her psychic powers. She sees visions of Enzo but breaks their connection in order to channel her powers into saving Caroline's daughters. Enzo makes her promise to live her life and swears he will see her again before she lets him go. Enzo then makes Bonnie realize her strength, and continues to watch over her as she fulfills her promise by living her life as she happily travels the world.\nThe following is a list of characters that are, or at one time were, a recurring guest on the series (but never starring). They are listed in the order that they first appeared on the show.\nElizabeth \"Liz\" Forbes is the Sheriff of Mystic Falls and the mother of Caroline Forbes. Her husband, Bill Forbes, who was a member of the town's council, had left her for another man after revealing that he was gay. She is first introduced at a Founders Day party at Mayor Lockwood's house. There, she is shown to have a strained relationship with her daughter. However, she does care a lot for her well-being, which is shown when she arrests a bartender after Caroline gets drunk. She is revealed to be a member of the Founders' Council, a secret organization dedicated to protecting Mystic Falls from vampires. Liz becomes friends with Damon after he saves her from Lexi Branson, and is seen letting him know about the council's plans. In the season one finale, she is handcuffed by John Gilbert for disagreeing with his plan to use the town as bait to capture the tomb vampires. She is later saved by Carol Lockwood, but they are unable to save Mayor Lockwood, who is burned with the vampires. Liz then finds out that her daughter has been in a car crash and goes to the hospital, where she is comforted by Damon.\nIn season two, Carol accuses Liz of getting Mayor Lockwood killed. Liz is later informed by Mason Lockwood that Damon and Stefan are vampires, though she is skeptical, particularly regarding Damon. She tests him by slipping vervain into his drink and he reacts negatively to it. When Damon and Stefan assume Mason did it and attempt to take care of him in the woods, Liz ambushes and shoots the brothers and has them injected with vervain. Liz tortures Damon in an attempt to learn how he and Stefan can walk in the sun, but is interrupted when Elena appears, followed by Caroline, who kills the deputies. Liz is locked in the cellar at the Salvatore House so that the vervain can get out of her system and she can be compelled to forget everything. Liz asks Damon to keep Caroline away from her, but after a talk Liz eventually accepts Caroline being a vampire; Caroline decides to compel her and Liz loses her memory of the whole ordeal.\nAfter Matt discovers the truth about vampires from Caroline, he tells Liz, who comes up with a plan to make Matt pretend to be compelled to forget, while he actually has vervain in his system. Liz then uses Matt to spy on Caroline, who she believes is a monster. Liz tries to capture and kill Damon, but accidentally shoots Jeremy instead. Believing she has killed Jeremy, she is shocked to discover that Bonnie is able to resurrect him. She finds out that Matt came clean to Caroline. After confessing that neither wanted to secretly live in fear of one another, Liz accepts her daughter for what she is. After Caroline is locked in a cellar by her father for being a vampire, Liz and Tyler come to her rescue. Liz assists her daughter and her friends throughout the series as their relationship continues to improve and she becomes closer friends with Damon, before it is revealed that she's dying from cancer in season six. Liz is seen in the series finale watching over Caroline.\nRichard Lockwood was Tyler Lockwood's father, the mayor of Mystic Falls and the head of the Founders' Council. He had a bad relationship with his son and acts very authoritative towards him. It seems that he thinks of Tyler as a disappointment and when Tyler gets into a fist-fight with Matt Donovan at a party, Richard tells him to never embarrass his family again. When Tyler gets into a fight with Jeremy, he takes them outside and tells them to fight rather than talk to solve their problems. He had an unhappy marriage with Carol Lockwood and they constantly fight; he also flirts with Pearl. Although he seems kind and amicable to the outside world, he was actually quite selfish. In the season one finale, during Founders Day, he helps John Gilbert execute his plan to kill the tomb vampires. However, it backfires when he is affected by the device that neutralizes the vampires, due to carrying the werewolf gene. The deputies believe him to be a vampire and lock him in the basement, where he was killed by one of the tomb vampires.\nCarol Lockwood was the wife (and later widow) of Mayor Richard Lockwood and the mother of Tyler Lockwood. She was a member of The Founders' Council and knows of the existence of vampires, but not of the existence of werewolves. Throughout season one, Carol was locked in a hostile relationship with her best friend. She acts as a bad influence on her son Tyler, with much of his negative behavior emerging as a direct result of her snobbish behavior and emotional outbursts. In the season finale she shows, for the first time, that she cares for Richard. After releasing Liz, they vainly try to save Richard from the burning basement.\nCarol was shaken and upset by her husband's death and blames it on the deputies. Carol finds Tyler in his father's study thrashing the room in an angry tantrum; this behavior frightens her and she was further shaken after Mason Lockwood calms Tyler. Carol later informs Damon that she was replacing Richard as the mayor until the next election and asks him to lead the council, which he accepts. After Tyler has turned into a werewolf and runs away, she finds a note from Tyler. It was later revealed that Elijah, one of the original vampires, convinced Carol to stop taking vervain in order to compel her. When Elena frees Elijah, he compels Carol to let him take refuge in the Lockwood Mansion. Later, Carol was compelled to make a phone call to Tyler, saying that she was in the hospital and wanted him to come and visit; Maddox then uses his powers to push her off the stairs, and she is hospitalized.\nIn season three, Carol learns that Caroline Forbes is a vampire; after Caroline sleeps with Tyler in the Lockwood Mansion, Carol shoots her with vervain darts. Carol then calls Caroline's father, Bill Forbes, and tells him about her. The next day, Carol slips vervain in Tyler's coffee to test if he is a vampire, and is relieved that he isn't. However, Tyler discovers this and confronts his mother, who says Caroline a monster. Tyler then shows Carol that he is a werewolf, and Carol promises that she will make sure Caroline isn't hurt. However, when she later calls Bill, she was unable to persuade him to free Caroline. When the doorway to the Other Side was opened, the ghosts of the tomb vampires decide to take revenge on the founding families and attack Carol. Caroline comes to Carol's rescue and holds them until the doorway is closed.\nIn the ninth episode of season four, Carol was killed by Klaus as payback for Tyler's plan to kill him.\nSheila Bennett was the grandmother of Bonnie Bennett and a very powerful witch. She died after overusing her magic to seal away the tomb vampires. She usually appears to Bonnie (as a spirit) to help guide her whenever she overuses magic or is having trouble with her powers. Sheila continues to appear throughout the series, ensuring Bonnie's (and indirectly Damon's) survival. She makes an appearance in the series finale to help Bonnie save Mystic Falls with the rest of the Bennet witches.\nEmily Bennett was the handmaiden of Katherine Pierce in 1864 and a powerful witch. She was a direct descendant of one of the women accused of witchcraft during the Salem Witch Trials of 1692. Emily was an ancestor of Bonnie Bennett through Sheila Bennett. She was the one who gave Katherine, Pearl, Anna, Harper, Damon and Stefan the jewelry which enabled them to walk in the sun. Although she helped these vampires, she secretly fought against them, for she enchanted Jonathan Gilbert's inventions, including a device which could hurt vampires. When the vampires were rounded-up by the Founding Families, she and Damon made a bargain: Damon would protect Emily's descendants and Emily would use her grimoire to protect Katherine by entombing her with 26 other vampires under the old Fell's Church. Emily was later burned at the stake by the Founding Families and her possessions, including her grimoire, were taken and buried in Giuseppe Salvatore's grave. Damon rescued Emily's children when the townspeople came for her.\nIn season one, Emily possesses Bonnie in order to stop Damon from freeing Katherine from the tomb. In season two, Bonnie takes on the power of a hundred dead witches, including Emily, by performing a spell on the place where the witches were burned. Bonnie and Stefan later go there again to ask the witches if they know a cure for a werewolf bite (inflicted on Damon). Emily possesses Bonnie and tells Stefan there isn't a cure, but when Bonnie is herself again, she tells Stefan that Emily mentioned Klaus, whose blood turns out to be the cure for a werewolf bite. When Jeremy dies, Bonnie was able to save him with help of Emily after she tells Emily that she loves him.\nAlexia \"Lexi\" Branson was a vampire and Stefan's best friend and companion. She had known Stefan and his brother Damon for over a century. Damon killed her to make the town council think that she was the vampire terrorizing Mystic Falls. Lexi returned as a ghost to help save Stefan. She later choked Damon for killing her but let him go. She and Stefan stayed together for the most part drinking and later parting on good terms. Through flashbacks when Damon was killing people in New York as \"Son of Sam\", Stefan sent Lexi to help Damon. For about 6 months they hung out while Lexi would ask Damon about Katherine, trying to help him remember love. One night Damon claimed that he didn't love Katherine and that he had fallen for Lexi, and they had a night of wild sex; the next morning he locked her on a rooftop with the sun coming up as punishment for her spying. She came back for a scene at the end of the series finale, where Stefan hugs her.\nAnnabelle \"Anna\" was a vampire who comes to Mystic Falls in order to free her mother from the tomb. She was in Mystic Falls in 1864 with her mother, Pearl, and wants to open the tomb to free her mother. Anna turned Noah and Ben McKittrick into vampires to make them help her save her mother, turned Logan Fell to get Honoria Fell's diaries, and befriended Jeremy Gilbert to obtain his ancestor's journal. Anna later kidnaps Elena and Bonnie in order to make Bonnie open the tomb, but they are saved by Stefan, who kills Ben in the process. After Bonnie opens the tomb for Damon to free Katherine, Anna succeeds in freeing her mother and bringing her back to life. Anna later reveals to Damon that she knew Katherine wasn't in the tomb, but needed him to believe it in order to free her mother.\nAnna developed romantic feelings for Jeremy, who suspects that she was not human and tests it by forcing her to drink his blood. Anna confronts Jeremy over this, and refuses his requests to turn him into a vampire. She initially attempts to hide her involvement with Jeremy from Pearl, and Anna and Pearl eventually get into a fight. Anna agrees to turn Jeremy but learns his motive is to get over his first love, Vicki. After a short period of distance, they make up, both admitting to having used each other, but have fallen in love along the way. Anna enrolls in high school in order to spend time with Jeremy, and they begin a romantic relationship. Pearl is killed by Jeremy's uncle John Gilbert, devastating Anna, who is consoled by Jeremy.\nOn Founder's Day, Anna gives Jeremy a vial of her blood, telling him that if he drinks it he will die and become a vampire. She goes to the remaining tomb vampires, then reveals their plans to Damon â€“ possibly to protect Jeremy. Damon warns her about the device; she is protecting Jeremy when John Gilbert sets it off, and was immediately incapacitated. A policeman finds her with Jeremy, injects her with vervain and takes her to the Gilbert building to be burned with other vampires, repeating the 1864 plan to eradicate their kind. When John Gilbert sees Anna lying in the building with the other vampires, he stakes her; her body is burned with the others. Damon sees this and later tells Jeremy how Anna died, regretting that he wasn't able to help. Jeremy questions whether it would be better to be a vampire and Damon admits it would be easier to turn the emotions off. Later, Jeremy drinks Anna's blood and takes all of Elena's sleeping pills.\nIn the season two finale, Anna and Vicki's spirits appear to Jeremy, after he was brought back to life by a spell of Bonnie's. In season three, Anna and Vicki appear more often to Jeremy, and Anna warns Jeremy not to trust Vicki, who asks Jeremy to help her come back to life. Later, Anna tells Jeremy that she was \"on the other side\". She tells Jeremy that she understands he had to move on with Bonnie. They later get in an argument when Anna warns Jeremy about the darkness, popping-up at an awkward time. Jeremy shuts Anna out, leaving her alone on the Other Side. When Jeremy tells Bonnie, she asks him to no longer talk to Anna and completely shut her out.\nTo make Anna reveal the location of Mikael, Katherine and Damon kidnap and begin hurting Jeremy. Anna and Jeremy seem to be talking again, working together to stop Vicki. Anna's re-appearances indicate that Jeremy is thinking about her, even when he's with Bonnie. When the doorway to the Other Side is opened, they are able to touch and secretly hang out. Elena sees them as they kiss, and Bonnie is influenced to close the doorway when she learns of this.\nElena continues to fight with Jeremy and Anna over their relationship. It is revealed that Anna stole a necklace which is the key to keeping the door open, in hopes of finding her mother. Crying, she tells Jeremy she didn't meant for anyone to get hurt and she just didn't want to be alone anymore. Jeremy consoles her, and she gives him the necklace, letting him know it is alright to let her go. Before the door is closed, Anna finds her mother and they make peace.\nIsobel Flemming was Elena's birth mother and a descendant of Katherine Pierce. When Isobel was a teenager, she had a relationship with John Gilbert, by whom she later had a baby, Elena. When Isobel was pregnant, John brought her to his brother, Grayson Gilbert, who helped her through labor. After Elena's birth, a heartbroken Isobel gave her daughter to Grayson and his wife Miranda Gilbert. Isobel attended Duke University where she studied supernatural beings. Later in life, she met and married Alaric Saltzman. However, Isobel became obsessed with vampires and after being romantically involved with him, she asked Damon to turn her. She was assumed dead by the police and Alaric thought that she was killed by Damon after seeing them together.\nIn season one, Alaric comes to Mystic Falls to seek revenge on Damon, who admits that he killed Isobel, but that he also turned her into a vampire on her own request. Elena reaches out when she learns that Isobel is her biological mother, but Isobel avoids contact. Isobel later shows up at the Mystic Grill, greets Alaric, and threatens to kill everyone in town if she doesn't meet Elena. She is later visited by John in a loaned house, where she had two human minions, Cherie and Frank. It was revealed that Isobel, just like John, wants Jonathan's Gilbert's device â€“ because Katherine, whom she seemingly befriended, wants all the tomb vampires dead. In season two, it was revealed that Isobel wants them dead in order to protect Elena from Klaus. She asks Elena to make Damon give her the device, threatening to hurt Matt and Jeremy. Elena convinces Damon to give her the device by saying that Bonnie can despell it. However, it is later revealed that Bonnie only pretended to despell it. Elena gives Isobel the device, saying that Damon gave it out of love for her. It was revealed that Isobel cares about Elena and they plot to use the device to kill all the tomb vampires and the Salvatore brothers in order to protect her. Before leaving town, Isobel compels Alaric to get over her and tells him that she realizes it was a mistake to become a vampire.\nIn season two, Isobel returns and introduces herself to Jenna Sommers as Elena's mother, but Elena refuses to invite her in and slams the door in her face. However, John invites her in the next day. Isobel asks Elena to join her at a place safe from Klaus, but Elena refuses. Isobel later tells Katherine that she made a deal with Klaus for Katherine's freedom, but she has to give Klaus the moonstone and the Petrova doppelgÃ¤nger, Elena. Isobel tells Katherine to retrieve the moonstone from the Salvatore brothers. It was revealed that she asked John to break up Jenna and Alaric because she was jealous. Isobel then kidnaps Alaric and takes Elena to a graveyard where her parents placed a tombstone for her. It is revealed that Klaus compelled Isobel to devise a plan to capture Katherine and retrieve the moonstone, which was why she returned. Isobel tells Elena that as a human she dreamt of meeting her daughter, but instead Elena has only met the part of her that would betray her own flesh and blood. She then receives a message from Maddox to set Elena free and kill herself by taking off her necklace, exposing herself to sunlight and being burned to death.\nJohnathan \"John\" Gilbert II was Grayson Gilbert's younger brother, Elena's biological father and Jeremy's uncle. In their youth, Grayson taught him about the vampires through the journals of their ancestor, Johnathan Gilbert. They inherited one ring each, which prevented them from being killed by supernatural forces. John had a crush on Isobel Flemming-Saltzman and sent her to Damon when she wanted to become a vampire. After her transformation, Isobel found John and they formed a partnership to obtain a mysterious invention created by Jonathan Gilbert.\nJohn arrived in Mystic Falls for Founder's Day and was shown as a member of the Founders' Council. However, he knew Damon was a vampire, that there had been a tomb under the Fell's Church, and he knew about Katherine. He tried to intimidate Damon into helping him find the invention but Damon threatened to kill him and everyone in the Council. Alaric and Damon discovered John was watching the vampires who had been in the tomb. John confronts Pearl about her possession of the invention but Pearl had already given it to Damon. When Isobel returns to town, John obtains the invention, and it is revealed Isobel and John were working for Katherine and planning to kill the tomb vampires. Unofficially, their goal was to kill the Salvatore brothers and save Elena from suffering in a life filled with vampires. John was additionally responsible for staking Pearl. John's fingers (including one wearing the wring) are cut off by Katherine who stabs him, posing as Elena to gain access to the Gilbert house in the season one finale.\nIn the season two premiere, John was rushed to hospital and was confronted by Stefan and Elena about Katherine's attack on him. Stefan then tells John that Elena does not want him there and Stefan threatens to turn John into a vampire if he does not leave. John packs his bags and gives his ring to Jeremy, though it was not made clear whether he had actually left Mystic Falls. John later returns to Mystic Falls and tells Jenna that he was Elena's biological father. It was revealed that he and Isobel were working together to free Katherine. Elena had trouble believing and trusting John, especially after he invites Isobel into their house; Elena rejects them and leaves. Isobel kills John at a party at the Lockwood Mansion, but he was seen wearing his ring and was brought back to life hours later. Upon learning that Isobel had committed suicide, John comes to the conclusion that he's no longer wanted anywhere in Mystic Falls and prepares to leave. Elena asks him to stay as he's the only parent she had left. Later, he goes through with a spell to save Elena from turning into a vampire, at the cost of his own life. He leaves Elena his ring and a letter saying he would have loved her as a human or vampire.\nDr. Meredith Fell is a local doctor and a member of the Founders' Council. She uses vampire blood to cure people and starts dating Alaric. She knows that Alaric is unknowingly killing people because of his ring and wants to help him.\nApril Young is a girl from Elena and Jeremy's past; Elena used to babysit her. She returns to Mystic Falls for her father's memorial service. She is openly nice and befriends almost everyone. April becomes Rebekah's first real friend. She was unaware of the existence of supernatural creatures in Mystic Falls and was visibly frightened by Connor Jordan, who attacked her twice during his vampire hunts. When Rebekah disappears, April finds her and frees her by removing the dagger. She learns about the existence of vampires in Mystic Falls from Rebekah and helps her gain information from Elena, Stefan and Caroline about the cure for vampirism.\nOlivia \"Liv\" Parker is a powerful and talented witch. She is in a coven – one which hates everything the Travelers stand for – that protects doppelgängers from the Travelers, especially Elena. She was a witch of the Gemini Coven and the twin sister of the late Luke Parker. Liv was the younger sister of Josette Parker, Malachai Parker, Joey Parker and three deceased unnamed siblings. She was the youngest daughter of Joshua Parker.\nIn season five, Liv was seen attending Whitmore College. She was introduced as an inexperienced witch and sought out Bonnie Bennett to help her. However, Liv and her brother were secretly sent by their coven to stop Markos and the Travelers. After Caroline Forbes snaps Luke's neck sending him to the Other Side, Liv was forced to perform a spell that allows the deceased to be resurrected. Luke was revived and, as Liv became weaker, he told her to stop the spell. The two then fled, leaving Damon and Bonnie trapped in the collapsing Other Side.\nIn season six, Liv continued attending college and had developed a romantic relationship in Tyler Lockwood. She carefully watched over Tyler, doing everything to make sure his werewolf gene didn't trigger. Liv and Luke are later reunited with their long-lost sister, Jo; they reveal that, as the twin children of the Gemini Coven's leader, they must merge their powers on their twenty-second birthday – the stronger of the two will become more powerful while the weaker will die. In the season six finale, Liv was killed by Tyler – at her request – so that he could trigger his werewolf gene in order to heal the wounds inflicted on him by Kai.\nLucas \"Luke\" Parker is a warlock and Liv's twin brother. He is protective of his sister and is in the same coven as her. He is openly gay. He is a younger brother of twins Josette and Malachai Parker, Joey Parker and three unnamed deceased siblings. He was the youngest son of Joshua Parker.\nIn season five, Luke was seen attending Whitmore College. He quickly found himself working with Elena and her friends in an effort to stop Markos and the Travelers. Luke's neck was snapped by Caroline Forbes in order to motivate Liv to cast a spell to resurrect him, Stefan and the rest of their deceased friends on the rapidly disintegrating Other Side. Liv eventually revived Luke, and when he saw how the spell was draining her of her life force, he used his magic to force her to stop the spell. The two then fled, leaving Damon and Bonnie trapped on the Other Side when it collapsed.\nIn season six, it was revealed that Luke felt bad for leaving Damon and Bonnie trapped on the Other Side, and started providing hallucinogenic herbs to Elena so she could communicate with Damon. Luke explained to the group about his family's dark past and how he would eventually have to merge with his twin, Liv. He completed the merge ceremony with Kai through a loophole because he didn't want to kill Liv, nor did he want Kai to do the same to Jo and take the leadership of their coven. He went into the ceremony believing that he could win, but he ended up losing the merge ceremony and his life essence was absorbed by Kai, along with his ability to possess magic (something Kai was not born with). An unintended side-effect of the merge was Kai absorbing Luke's personality traits, such as his compassion and empathy, which have tempered his own sociopathic personality.\nMalachai \"Kai\" Parker is the twin brother of Josette, the older brother of Olivia, Lucas, Joey, and three other unnamed and deceased Parker siblings. He is a Siphoner, a witch born without the ability to generate his own magic but possessing a rare power that allows him to siphon and use magic from other sources. Because of this, Kai's parents and the rest of the Gemini Coven (excluding his siblings) treated him as an abomination, which eventually caused him to go insane and kill the siblings born to replace him. The coven then harnessed the power of a solar eclipse to trap him in a purgatory dimension, which kept him trapped in a snapshot of May 10, 1994 for 20 years.\nLillian \"Lily\" Salvatore is the mother of Stefan and Damon Salvatore and the widow of the late Giuseppe Salvatore. It has been suggested that she was kinder than her husband, Giuseppe. When Lily was very sick with consumption, she was sent away by Giuseppe. An unknown nurse (who was assumed to have been a vampire) fed her vampire blood while she was in the tuberculosis ward in 1858. Lily died of consumption, triggering her transformation into a vampire. Realizing this, Lily faked her death and abandoned her family, protecting them from the threat she posed. When she fled to Europe, she succumbed to her bloodlust and became a Ripper vampire, slaughtering victims for blood in the most gruesome ways. Lily moved from city to city, killing many people, until she was encountered by the Gemini Coven in Manhattan. As a punishment for killing so many people, they trapped her in a prison world on October 31, 1903, where she was stuck for over a century.\nValerie is a witch-vampire hybrid, and a member of the Heretics. She had a short romance with Stefan in 1863, when she was human. Valerie shelters in Stefan's house after being disowned and nearly killed by her own family. Valerie later helps Alaric find his unborn twin daughters, who had been spelled into Caroline's vampire womb. Valerie and Stefan discover a desiccated Caroline and realize the talisman didn't work. Valerie gathers the remaining Heretics and together they perform a spell to attract the babies into being born. As others are forced to leave, Valerie stays behind, and Bonnie arrives to tell her of Beau's death. Bonnie and Valerie then perform a spell and the babies are born.\nValerie speaks to Stefan of a magical safehouse for supernatural travelers in New Orleans, though then loses contact with him and informs Bonnie about it. She works with Matt – despite their antagonistic relationship – to help Stefan escape from Rayna Cruz. Valerie informs Damon of the Armory's dark intentions. While Valerie and Stefan spend three years running from Rayna, they search for a magical herb to cloak Stefan's Hunter scar from Rayna's tracking abilities, and later begin a romantic relationship. Damon gets Valerie to reveal that she knew all along about a cure for Stefan's Hunter scar, but didn't want to lose Stefan to Damon or Caroline. Valerie is subdued by Damon before she can transfer the scar onto Damon, which buys Rayna enough time to stab Stefan with her sword and trap him in the Phoenix Stone. Valerie flees on an airplane, distressed about Stefan's entrapment.\nThe following is a list of minor characters who have had a story arc on the series that lasted four episodes or more. They are listed in the order that they first appeared on the show.\nIn 2013, a spin-off television series based around the Mikaelson clan of vampires, called The Originals, was ordered to series by The CW. Many of the characters on The Originals initially appeared on The Vampire Diaries, including Klaus, Elijah and Rebekah Mikaelson.",
        "response": "```json\n{\n  \"nodes\": [\n    {\n      \"id\": \"the_vampire_diaries\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"The Vampire Diaries\",\n        \"genre\": \"fantasy-drama\",\n        \"startYear\": \"2009\",\n        \"endYear\": \"2017\",\n        \"episodeCount\": 171,\n        \"seasonCount\": 8,\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"the_cw\",\n      \"label\": \"organization\",\n      \"attributes\": {\n        \"name\": \"The CW\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"kevin_williamson\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Kevin Williamson\",\n        \"role\": \"adapter\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"julie_plec\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Julie Plec\",\n        \"role\": \"adapter\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"lj_smith\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"L.J. Smith\",\n        \"role\": \"author\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"the_originals\",\n      \"label\": \"television_series\",\n      \"attributes\": {\n        \"name\": \"The Originals\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"mystic_falls\",\n      \"label\": \"location\",\n      \"attributes\": {\n        \"name\": \"Mystic Falls\",\n        \"state\": \"Virginia\",\n        \"isFictional\": true,\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"elena_gilbert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Elena Gilbert\",\n        \"role\": \"central character\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"stefan_salvatore\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Stefan Salvatore\",\n        \"role\": \"vampire\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"damon_salvatore\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Damon Salvatore\",\n        \"role\": \"vampire\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"katherine_pierce\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Katherine Pierce\",\n        \"role\": \"antagonist\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"john_gilbert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"John Gilbert\",\n        \"relation\": \"father\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"isobel_flemming\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Isobel Flemming\",\n        \"isVampire\": true,\n        \"relation\": \"mother\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"grayson_gilbert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Grayson Gilbert\",\n        \"relation\": \"adoptive father\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"miranda_gilbert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Miranda Gilbert\",\n        \"relation\": \"adoptive mother\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"jeremy_gilbert\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Jeremy Gilbert\",\n        \"role\": \"adoptive brother\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"jenna_sommers\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Jenna Sommers\",\n        \"role\": \"adoptive aunt\",\n        \"guardian\": \"legal\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"kai_parker\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Kai Parker\",\n        \"role\": \"antagonist\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"bonnie_bennett\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Bonnie Bennett\",\n        \"role\": \"witch\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"caroline_forbes\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Caroline Forbes\",\n        \"role\": \"vampire\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"matt_donovan\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Matt Donovan\",\n        \"role\": \"sheriff\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"tyler_lockwood\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Tyler Lockwood\",\n        \"role\": \"werewolf\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"alaric_saltzman\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Alaric Saltzman\",\n        \"role\": \"teacher\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"enzo_john\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Enzo John\",\n        \"role\": \"vampire\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"liz_forbes\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Liz Forbes\",\n        \"role\": \"sheriff\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"carol_lockwood\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Carol Lockwood\",\n        \"relation\": \"mother\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"richard_lockwood\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Richard Lockwood\",\n        \"relation\": \"father\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"annabelle\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Annabelle\",\n        \"mother\": \"Pearl\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"id\": \"pearl\",\n      \"label\": \"person\",\n      \"attributes\": {\n        \"name\": \"Pearl\",\n        \"documentId\": \"doc11\"\n      }\n    }\n  ],\n  \"relationships\": [\n    {\n      \"source\": \"the_vampire_diaries\",\n      \"target\": \"the_cw\",\n      \"type\": \"BROADCASTED_BY\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"kevin_williamson\",\n      \"target\": \"the_vampire_diaries\",\n      \"type\": \"ADAPTED\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"julie_plec\",\n      \"target\": \"the_vampire_diaries\",\n      \"type\": \"ADAPTED\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"lj_smith\",\n      \"target\": \"the_vampire_diaries\",\n      \"type\": \"SOURCE_AUTHOR\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"the_originals\",\n      \"target\": \"the_vampire_diaries\",\n      \"type\": \"SPIN_OFF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"elena_gilbert\",\n      \"target\": \"stefan_salvatore\",\n      \"type\": \"RELATIONSHIP\",\n      \"attributes\": {\n        \"relationshipType\": \"romantic interest\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"elena_gilbert\",\n      \"target\": \"damon_salvatore\",\n      \"type\": \"RELATIONSHIP\",\n      \"attributes\": {\n        \"relationshipType\": \"romantic interest\",\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"stefan_salvatore\",\n      \"target\": \"damon_salvatore\",\n      \"type\": \"BROTHERS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"katherine_pierce\",\n      \"target\": \"stefan_salvatore\",\n      \"type\": \"VAMPIRE_CREATOR\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"katherine_pierce\",\n      \"target\": \"damon_salvatore\",\n      \"type\": \"VAMPIRE_CREATOR\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"john_gilbert\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"FATHER_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"isobel_flemming\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"MOTHER_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"grayson_gilbert\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"ADOPTIVE_PARENTS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"miranda_gilbert\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"ADOPTIVE_PARENTS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"jeremy_gilbert\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"ADOPTIVE_SIBLING\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"jenna_sommers\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"LEGAL_GUARDIAN\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"elena_gilbert\",\n      \"target\": \"kai_parker\",\n      \"type\": \"SACRIFICE_TARGET\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"bonnie_bennett\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"FRIENDS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"caroline_forbes\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"FRIENDS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"matt_donovan\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"CHILDHOOD_FRIENDS\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"tyler_lockwood\",\n      \"target\": \"caroline_forbes\",\n      \"type\": \"ROMANTIC_HISTORY\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"alaric_saltzman\",\n      \"target\": \"elena_gilbert\",\n      \"type\": \"FATHER_FIGURE\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"enzo_john\",\n      \"target\": \"damon_salvatore\",\n      \"type\": \"FRIENDSHIP\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"liz_forbes\",\n      \"target\": \"caroline_forbes\",\n      \"type\": \"MOTHER_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"carol_lockwood\",\n      \"target\": \"tyler_lockwood\",\n      \"type\": \"MOTHER_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"richard_lockwood\",\n      \"target\": \"tyler_lockwood\",\n      \"type\": \"FATHER_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    },\n    {\n      \"source\": \"annabelle\",\n      \"target\": \"pearl\",\n      \"type\": \"CHILD_OF\",\n      \"attributes\": {\n        \"documentId\": \"doc11\"\n      }\n    }\n  ]\n}\n```"
    }
]